[
  {
    "id": "auth",
    "title": "Authentication",
    "description": "Securing your online account login credentials",
    "longDescription": "Most reported data breaches are caused by the use of weak, default, or stolen passwords. This section covers best practices for passwords, multi-factor authentication, and secure login habits, organized into specific security domains.",
    "iconName": "KeyIcon",
    "color": "#facc15",
    "domains": [
      {
        "id": "governance",
        "title": "Governance",
        "description": "Policies and procedures for authentication.",
        "longDescription": "Establishing a strong governance framework for authentication ensures that policies are consistently applied, roles are clearly defined, and the overall strategy aligns with business objectives.",
        "items": [
          {
            "id": "governance-1762108260723",
            "security": "all the data have been done",
            "priority": "Optional",
            "details": "s",
            "status": "In review",
            "result": "Non compliant",
            "observation": "need to be veriify the ce",
            "evidence": ""
          }
        ],
        "domains": []
      },
      {
        "id": "asset-management",
        "title": "Asset Management",
        "description": "Managing assets related to authentication.",
        "longDescription": "Properly managing authentication-related assets, such as password databases and hardware tokens, is crucial for maintaining security and accountability throughout their lifecycle.",
        "items": [],
        "domains": []
      },
      {
        "id": "information-protection",
        "title": "Information Protection",
        "description": "Protecting authentication information.",
        "longDescription": "This domain focuses on the technical controls and processes required to protect sensitive authentication data, like password hashes and biometric information, from unauthorized access or disclosure.",
        "items": [],
        "domains": []
      },
      {
        "id": "human-resource-security",
        "title": "Human Resource Security",
        "description": "Managing user access throughout employment.",
        "longDescription": "Integrating authentication management with HR processes ensures that access is granted, modified, and revoked in a timely manner as employees join, change roles, or leave the organization.",
        "items": [],
        "domains": []
      },
      {
        "id": "physical-security",
        "title": "Physical Security",
        "description": "Securing physical authentication tokens.",
        "longDescription": "This domain covers the measures needed to protect physical authentication factors, such as smart cards, hardware tokens, and the facilities where critical authentication systems are housed.",
        "items": [],
        "domains": []
      },
      {
        "id": "system-and-network-security",
        "title": "System and Network Security",
        "description": "Securing systems that handle authentication.",
        "longDescription": "Ensuring the underlying systems and networks that process authentication requests are secure is fundamental to preventing credential theft and unauthorized access.",
        "items": [],
        "domains": []
      },
      {
        "id": "application-security",
        "title": "Application Security",
        "description": "Secure authentication in applications.",
        "longDescription": "This domain focuses on implementing secure authentication mechanisms within applications, including session management, password policies, and protection against common attacks like credential stuffing.",
        "items": [],
        "domains": []
      },
      {
        "id": "secure-configuration",
        "title": "Secure Configuration",
        "description": "Hardening authentication services.",
        "longDescription": "Properly configuring authentication services, such as directory services and single sign-on platforms, is critical to eliminate vulnerabilities and enforce security policies.",
        "items": [],
        "domains": []
      },
      {
        "id": "identity-and-access-management",
        "title": "Identity and Access Management",
        "description": "Core principles of user authentication.",
        "longDescription": "The core of authentication security. Use long, strong, and unique passwords, manage them in a secure password manager, enable 2-factor authentication, keep on top of breaches, and take care while logging into your accounts.",
        "items": [
          {
            "id": "auth-0",
            "security": "Use a Strong Password",
            "priority": "Essential",
            "details": "If your password is too short, or contains dictionary words, places, or names, then it can be easily cracked through brute force or guessed by someone. The easiest way to make a strong password is by making it long (12+ characters) — consider using a 'passphrase' made up of many words. Alternatively, use a password generator to create a long, strong random password. Have a play with [Security.org's How Secure Is My Password?](https://security.org/how-secure-is-my-password/), to get an idea of how quickly common passwords can be cracked. Read more about creating strong passwords: [securityinabox.org](https://securityinabox.org/en/passwords/passwords-and-2fa/).",
            "status": "To do",
            "result": "Not assessed",
            "observation": "",
            "evidence": ""
          },
          {
            "id": "auth-1",
            "security": "Don't Reuse Passwords",
            "priority": "Essential",
            "details": "If someone were to reuse a password and one site they had an account with suffered a leak, then a criminal could easily gain unauthorized access to their other accounts. This is usually done through large-scale automated login requests, and it is called Credential Stuffing. Unfortunately, this is all too common, but it's simple to protect against — use a different password for each of your online accounts.",
            "status": "To do",
            "result": "Not assessed",
            "observation": "",
            "evidence": ""
          },
          {
            "id": "auth-2",
            "security": "Use a Secure Password Manager",
            "priority": "Essential",
            "details": "For most people, it is going to be near-impossible to remember hundreds of strong and unique passwords. A password manager is an application that generates, stores, and auto-fills your login credentials for you. All your passwords will be encrypted against 1 master password (which you must remember, and it should be very strong). Most password managers have browser extensions and mobile apps, so whatever device you are on, your passwords can be auto-filled. A good all-rounder is [Bitwarden](https://awesome-privacy.xyz/essentials/password-managers/bitwarden), or see [Recommended Password Managers](https://awesome-privacy.xyz/essentials/password-managers).",
            "status": "To do",
            "result": "Not assessed",
            "observation": "",
            "evidence": ""
          },
          {
            "id": "auth-3",
            "security": "Avoid Sharing Passwords",
            "priority": "Essential",
            "details": "While there may be times that you need to share access to an account with another person, you should generally avoid doing this because it makes it easier for the account to become compromised. If you absolutely do need to share a password — for example, when working on a team with a shared account — this should be done via features built into a password manager.",
            "status": "To do",
            "result": "Not assessed",
            "observation": "",
            "evidence": ""
          },
          {
            "id": "auth-4",
            "security": "Enable 2-Factor Authentication",
            "priority": "Essential",
            "details": "2FA is where you must provide both something you know (a password) and something you have (such as a code on your phone) to log in. This means that if anyone has your password (e.g., through phishing, malware, or a data breach), they will not be able to log into your account. It's easy to get started, download [an authenticator app](https://github.com/Lissy93/awesome-privacy#2-factor-authentication) onto your phone, and then go to your account security settings and follow the steps to enable 2FA. Next time you log in on a new device, you will be prompted for the code that is displayed in the app on your phone (it works without internet, and the code usually changes every 30 seconds).",
            "status": "To do",
            "result": "Not assessed",
            "observation": "",
            "evidence": ""
          },
          {
            "id": "auth-5",
            "security": "Keep Backup Codes Safe",
            "priority": "Essential",
            "details": "When you enable multi-factor authentication, you will usually be given several codes that you can use if your 2FA method is lost, broken, or unavailable. Keep these codes somewhere safe to prevent loss or unauthorized access. You should store these on paper or in a safe place on disk (e.g., in offline storage or an encrypted file/drive). Don't store these in your password manager as 2FA sources and passwords should be kept separately.",
            "status": "To do",
            "result": "Not assessed",
            "observation": "",
            "evidence": ""
          },
          {
            "id": "auth-6",
            "security": "Sign Up for Breach Alerts",
            "priority": "Optional",
            "details": "After a website suffers a significant data breach, the leaked data often ends up on the internet. Several websites collect these leaked records and allow you to search your email address to check if you are in any of their lists. [Firefox Monitor](https://monitor.firefox.com), [Have I Been Pwned](https://haveibeenpwned.com), and [DeHashed](https://dehashed.com) allow you to sign up for monitoring, where they will notify you if your email address appears in any new data sets. It is useful to know as soon as possible when this happens so that you can change your passwords for the affected accounts. [Have i been pwned](https://awesome-privacy.xyz/security-tools/online-tools/have-i-been-pwned) also has domain-wide notification, where you can receive alerts if any email addresses under your entire domain appear (useful if you use aliases for [anonymous forwarding](https://github.com/Lissy93/awesome-privacy#anonymous-mail-forwarding)).",
            "status": "To do",
            "result": "Not assessed",
            "observation": "",
            "evidence": ""
          },
          {
            "id": "auth-7",
            "security": "Shield your Password/PIN",
            "priority": "Optional",
            "details": "When typing your password in public places, ensure you are not in direct line of sight of a CCTV camera and that no one can see over your shoulder. Cover your password or pin code while you type, and do not reveal any plain text passwords on your screen.",
            "status": "To do",
            "result": "Not assessed",
            "observation": "",
            "evidence": ""
          },
          {
            "id": "auth-8",
            "security": "Update Critical Passwords Periodically",
            "priority": "Optional",
            "details": "Database leaks and breaches are common, and, likely, several of your passwords are already somewhere online. Occasionally updating passwords of security-critical accounts can help mitigate this. But providing that all your passwords are long, strong, and unique, there is no need to do this too often — annually should be sufficient. Enforcing mandatory password changes within organisations is [no longer recommended](https://duo.com/decipher/microsoft-will-no-longer-recommend-forcing-periodic-password-changes), as it encourages colleagues to select weaker passwords.",
            "status": "To do",
            "result": "Not assessed",
            "observation": "",
            "evidence": ""
          },
          {
            "id": "auth-9",
            "security": "Don’t Save your Password in Browsers",
            "priority": "Optional",
            "details": "Most modern browsers offer to save your credentials when you log into a site. Don’t allow this, as they are not always encrypted and could allow someone to gain access to your accounts. Instead, use a dedicated password manager to store (and auto-fill) your passwords.",
            "status": "To do",
            "result": "Not assessed",
            "observation": "",
            "evidence": ""
          },
          {
            "id": "auth-10",
            "security": "Avoid Logging In on Someone Else’s Device",
            "priority": "Optional",
            "details": "Avoid logging in on other people's computers since you can't be sure their system is clean. Be especially cautious of public machines, as malware and tracking arr more common here. Using someone else's device is especially dangerous with critical accounts like online banking. When using someone else's machine, ensure that you're in a private/incognito session (Use Ctrl+Shift+N/ Cmd+Shift+N). This will request the browser to not save your credentials, cookies, and browsing history.",
            "status": "To do",
            "result": "Not assessed",
            "observation": "",
            "evidence": ""
          },
          {
            "id": "auth-11",
            "security": "Avoid Password Hints",
            "priority": "Optional",
            "details": "Some sites allow you to set password hints. Often, it is very easy to guess answers. In cases where password hints are mandatory, use random answers and record them in your password manager (`Name of the first school: 6D-02-8B-!a-E8-8F-81`).",
            "status": "To do",
            "result": "Not assessed",
            "observation": "",
            "evidence": ""
          },
          {
            "id": "auth-12",
            "security": "Never Answer Online Security Questions Truthfully",
            "priority": "Optional",
            "details": "If a site asks security questions (such as place of birth, mother's maiden name, or first car, etc.), don't provide real answers. It is a trivial task for hackers to find out this information online or through social engineering. Instead, create a fictitious answer, and store it inside your password manager. Using real words is better than random characters, as [explained here](https://news.ycombinator.com/item?id=29244870).",
            "status": "To do",
            "result": "Not assessed",
            "observation": "",
            "evidence": ""
          },
          {
            "id": "auth-13",
            "security": "Don’t Use a 4-digit PIN",
            "priority": "Optional",
            "details": "Don’t use a short PIN to access your smartphone or computer. Instead, use a text password or a much longer PIN. Numeric passphrases are easy to crack (A 4-digit pin has 10,000 combinations, compared to 7.4 million for a 4-character alpha-numeric code).",
            "status": "To do",
            "result": "Not assessed",
            "observation": "",
            "evidence": ""
          },
          {
            "id": "auth-14",
            "security": "Avoid Using SMS for 2FA",
            "priority": "Optional",
            "details": "When enabling multi-factor authentication, opt for app-based codes or a hardware token if supported. SMS is susceptible to several common threats, such as [SIM-swapping](https://www.maketecheasier.com/sim-card-hijacking) and [interception](https://secure-voice.com/ss7_attacks). There's also no guarantee of how securely your phone number will be stored or what else it will be used for. From a practical point of view, SMS will only work when you have a signal and can be slow. If a website or service requires the usage of an SMS number for recovery, consider purchasing a second pre-paid phone number only used for account recovery for these instances.",
            "status": "To do",
            "result": "Not assessed",
            "observation": "",
            "evidence": ""
          },
          {
            "id": "auth-15",
            "security": "Avoid Using your PM to Generate OTPs",
            "priority": "Advanced",
            "details": "Many password managers are also able to generate 2FA codes. It is best not to use your primary password manager as your 2FA authenticator as well, since it would become a single point of failure if compromised. Instead, use a dedicated [authenticator app](https://github.com/Lissy93/awesome-privacy#2-factor-authentication) on your phone or laptop.",
            "status": "To do",
            "result": "Not assessed",
            "observation": "",
            "evidence": ""
          },
          {
            "id": "auth-16",
            "security": "Avoid Face Unlock",
            "priority": "Advanced",
            "details": "Most phones and laptops offer a facial recognition authentication feature, using the camera to compare a snapshot of your face with a stored hash. It may be very convenient, but there are numerous ways to [fool it](https://www.forbes.com/sites/jvchamary/2017/09/18/security-apple-face-id-iphone-x/) and gain access to the device through digital photos and reconstructions from CCTV footage. Unlike your password, there are likely photos of your face on the internet and videos recorded by surveillance cameras.",
            "status": "To do",
            "result": "Not assessed",
            "observation": "",
            "evidence": ""
          },
          {
            "id": "auth-17",
            "security": "Watch Out for Keyloggers",
            "priority": "Advanced",
            "details": "A hardware [keylogger](https://en.wikipedia.org/wiki/Hardware_keylogger) is a physical device planted between your keyboard and the USB port, which intercepts all keystrokes and sometimes relays data to a remote server. It gives a hacker access to everything typed, including passwords. The best way to stay protected is just by checking your USB connection after your PC has been unattended. It is also possible for keyloggers to be planted inside the keyboard housing, so look for any signs that the case has been tampered with, and consider bringing your own keyboard to work. Data typed on a virtual keyboard, pasted from the clipboard, or auto-filled by a password manager can not be intercepted by a hardware keylogger.",
            "status": "To do",
            "result": "Not assessed",
            "observation": "",
            "evidence": ""
          },
          {
            "id": "auth-18",
            "security": "Consider a Hardware Token",
            "priority": "Advanced",
            "details": "A U2F/FIDO2 security key is a USB (or NFC) device that you insert while logging in to an online service to verify your identity instead of entering a OTP from your authenticator. [SoloKey](https://solokeys.com) and [NitroKey](https://www.nitrokey.com) are examples of such keys. They bring with them several security benefits. Since the browser communicates directly with the device, it cannot be fooled as to which host is requesting authentication because the TLS certificate is checked. [This post](https://security.stackexchange.com/a/71704) is a good explanation of the security of using FIDO U2F tokens. Of course, it is important to store the physical key somewhere safe or keep it on your person. Some online accounts allow for several methods of 2FA to be enabled.",
            "status": "To do",
            "result": "Not assessed",
            "observation": "",
            "evidence": ""
          },
          {
            "id": "auth-19",
            "security": "Consider Offline Password Manager",
            "priority": "Advanced",
            "details": "For increased security, an encrypted offline password manager will give you full control over your data. [KeePass](https://awesome-privacy.xyz/essentials/password-managers/keepass) is a popular choice, with lots of [plugins](https://keepass.info/plugins.html) and community forks with additional compatibility and functionality. Popular clients include: [KeePassXC](https://keepassxc.org) (desktop), [KeePassDX](https://www.keepassdx.com) (Android) and [StrongBox](https://apps.apple.com/us/app/strongbox-password-safe/id897283731) (iOS). The drawback being that it may be slightly less convenient for some, and it will be up to you to back it up and store it securely.",
            "status": "To do",
            "result": "Not assessed",
            "observation": "",
            "evidence": ""
          },
          {
            "id": "auth-20",
            "security": "Consider Unique Usernames",
            "priority": "Advanced",
            "details": "Having different passwords for each account is a good first step, but if you also use a unique username, email, or phone number to log in, then it will be significantly harder for anyone trying to gain unauthorised access. The easiest method for multiple emails, is using auto-generated aliases for anonymous mail forwarding. This is where [anything]@yourdomain.com will arrive in your inbox, allowing you to use a different email for each account (see [Mail Alias Providers](https://github.com/Lissy93/awesome-privacy#mail-forwarding)). Usernames are easier since you can use your password manager to generate, store, and auto-fill these. Virtual phone numbers can be generated through your VOIP provider.",
            "status": "To do",
            "result": "Not assessed",
            "observation": "",
            "evidence": ""
          }
        ],
        "domains": []
      },
      {
        "id": "threat-and-vulnerability-management",
        "title": "Threat and Vulnerability Management",
        "description": "Identifying and mitigating threats.",
        "longDescription": "Proactively identifying, assessing, and mitigating vulnerabilities in authentication systems is essential to defend against evolving threats.",
        "items": [],
        "domains": []
      },
      {
        "id": "continuity",
        "title": "Continuity",
        "description": "Ensuring authentication services are resilient.",
        "longDescription": "Planning for disruptions to authentication services ensures that users can maintain access to critical systems during an incident.",
        "items": [],
        "domains": []
      },
      {
        "id": "supplier-relationships-security",
        "title": "Supplier Relationships Security",
        "description": "Managing third-party authentication risks.",
        "longDescription": "When relying on third-party providers for authentication services, it is crucial to manage the associated security risks through due diligence and contractual agreements.",
        "items": [],
        "domains": []
      },
      {
        "id": "legal-and-compliance",
        "title": "Legal and Compliance",
        "description": "Adhering to authentication regulations.",
        "longDescription": "Ensuring that authentication practices comply with relevant legal, statutory, and regulatory requirements is a critical aspect of information security.",
        "items": [],
        "domains": []
      },
      {
        "id": "information-security-event-management",
        "title": "Information Security Event Management",
        "description": "Responding to authentication incidents.",
        "longDescription": "Having a formal process for managing authentication-related security incidents is key to minimizing their impact and learning from them to prevent recurrence.",
        "items": [],
        "domains": []
      },
      {
        "id": "information-security-assurance",
        "title": "Information Security Assurance",
        "description": "Verifying authentication effectiveness.",
        "longDescription": "Regularly assessing and auditing authentication controls provides assurance that they are implemented correctly and operating effectively.",
        "items": [],
        "domains": []
      },
      {
        "id": "cryptography",
        "title": "Cryptography",
        "description": "Using encryption to protect credentials.",
        "longDescription": "Cryptography is the cornerstone of secure authentication, used to protect passwords in transit and at rest, and to ensure the integrity of authentication messages.",
        "items": [],
        "domains": []
      }
    ]
  },
  {
    "id": "a5--organizational-controls",
    "title": "A.5 – Organizational Controls",
    "description": " Define the organization’s governance, policies, and processes to manage information security systematically.",
    "longDescription": "Organizational controls are the foundation of an Information Security Management System (ISMS). They define how an organization establishes its governance, policies, responsibilities, and processes to manage information security in a structured, consistent, and proactive manner.",
    "iconName": "KeyIcon",
    "color": "#14fa6c",
    "items": [],
    "domains": []
  },
  {
    "id": "a7--physical-controls",
    "title": "People Controls (A.6)",
    "description": "Ensure that employees and contractors understand and fulfill their information security responsibilities.",
    "longDescription": "People controls focus on managing the human factors of information security. They ensure that all individuals involved with the organization are properly screened, trained, and made aware of their security obligations, both during and after employment.",
    "iconName": "GlobeIcon",
    "color": "#f31212",
    "items": [],
    "domains": []
  },
  {
    "id": "physical-controls-a7",
    "title": "Physical Controls (A.7)",
    "description": "Protect physical environments and assets from unauthorized access, damage, or interference.",
    "longDescription": "Physical controls ensure that facilities, systems, and equipment are protected from physical threats such as theft, fire, or environmental damage. They establish secure perimeters, control access to buildings and rooms, and safeguard infrastructure to maintain confidentiality, integrity, and availability of information.",
    "iconName": "MessageSquareIcon",
    "color": "#fa14d4",
    "items": [],
    "domains": []
  },
  {
    "id": "technological-controls-a8",
    "title": "Technological Controls (A.8)",
    "description": "Implement technical safeguards to protect systems, networks, and data from unauthorized access, misuse, or disruption.",
    "longDescription": "Technological controls apply technical measures to secure information systems, networks, and data against threats. These include access management, malware protection, encryption, system configuration, and continuous monitoring to ensure confidentiality, integrity, and availability of information.",
    "iconName": "Share2Icon",
    "color": "#14fac1",
    "items": [],
    "domains": []
  }
]