[
  {
    "id": "auth",
    "title": "ISO :27001 Clauses",
    "description": "Securing your online account login credentials",
    "longDescription": "Most reported data breaches are caused by the use of weak, default, or stolen passwords. This section covers best practices for passwords, multi-factor authentication, and secure login habits, organized into specific security domains.",
    "iconName": "KeyIcon",
    "color": "#facc15",
    "domains": [
      {
        "id": "governance",
        "title": "Governance",
        "description": "Policies and procedures for authentication.",
        "longDescription": "Establishing a strong governance framework for authentication ensures that policies are consistently applied, roles are clearly defined, and the overall strategy aligns with business objectives.",
        "items": [
          {
            "id": "governance-1762108260723",
            "security": "all the data have been done",
            "priority": "Optional",
            "details": "s",
            "status": "In review",
            "result": "Non compliant",
            "observation": "need to be veriify the ce",
            "evidence": ""
          }
        ],
        "domains": []
      },
      {
        "id": "asset-management",
        "title": "Asset Management",
        "description": "Managing assets related to authentication.",
        "longDescription": "Properly managing authentication-related assets, such as password databases and hardware tokens, is crucial for maintaining security and accountability throughout their lifecycle.",
        "items": [],
        "domains": []
      },
      {
        "id": "information-protection",
        "title": "Information Protection",
        "description": "Protecting authentication information.",
        "longDescription": "This domain focuses on the technical controls and processes required to protect sensitive authentication data, like password hashes and biometric information, from unauthorized access or disclosure.",
        "items": [],
        "domains": []
      },
      {
        "id": "human-resource-security",
        "title": "Human Resource Security",
        "description": "Managing user access throughout employment.",
        "longDescription": "Integrating authentication management with HR processes ensures that access is granted, modified, and revoked in a timely manner as employees join, change roles, or leave the organization.",
        "items": [],
        "domains": []
      },
      {
        "id": "physical-security",
        "title": "Physical Security",
        "description": "Securing physical authentication tokens.",
        "longDescription": "This domain covers the measures needed to protect physical authentication factors, such as smart cards, hardware tokens, and the facilities where critical authentication systems are housed.",
        "items": [],
        "domains": []
      },
      {
        "id": "system-and-network-security",
        "title": "System and Network Security",
        "description": "Securing systems that handle authentication.",
        "longDescription": "Ensuring the underlying systems and networks that process authentication requests are secure is fundamental to preventing credential theft and unauthorized access.",
        "items": [],
        "domains": []
      },
      {
        "id": "application-security",
        "title": "Application Security",
        "description": "Secure authentication in applications.",
        "longDescription": "This domain focuses on implementing secure authentication mechanisms within applications, including session management, password policies, and protection against common attacks like credential stuffing.",
        "items": [],
        "domains": []
      },
      {
        "id": "secure-configuration",
        "title": "Secure Configuration",
        "description": "Hardening authentication services.",
        "longDescription": "Properly configuring authentication services, such as directory services and single sign-on platforms, is critical to eliminate vulnerabilities and enforce security policies.",
        "items": [],
        "domains": []
      },
      {
        "id": "identity-and-access-management",
        "title": "Identity and Access Management",
        "description": "Core principles of user authentication.",
        "longDescription": "The core of authentication security. Use long, strong, and unique passwords, manage them in a secure password manager, enable 2-factor authentication, keep on top of breaches, and take care while logging into your accounts.",
        "items": [
          {
            "id": "auth-0",
            "security": "Use a Strong Password",
            "priority": "Essential",
            "details": "If your password is too short, or contains dictionary words, places, or names, then it can be easily cracked through brute force or guessed by someone. The easiest way to make a strong password is by making it long (12+ characters) — consider using a 'passphrase' made up of many words. Alternatively, use a password generator to create a long, strong random password. Have a play with [Security.org's How Secure Is My Password?](https://security.org/how-secure-is-my-password/), to get an idea of how quickly common passwords can be cracked. Read more about creating strong passwords: [securityinabox.org](https://securityinabox.org/en/passwords/passwords-and-2fa/).",
            "status": "To do",
            "result": "Not assessed",
            "observation": "",
            "evidence": ""
          },
          {
            "id": "auth-1",
            "security": "Don't Reuse Passwords",
            "priority": "Essential",
            "details": "If someone were to reuse a password and one site they had an account with suffered a leak, then a criminal could easily gain unauthorized access to their other accounts. This is usually done through large-scale automated login requests, and it is called Credential Stuffing. Unfortunately, this is all too common, but it's simple to protect against — use a different password for each of your online accounts.",
            "status": "To do",
            "result": "Not assessed",
            "observation": "",
            "evidence": ""
          },
          {
            "id": "auth-2",
            "security": "Use a Secure Password Manager",
            "priority": "Essential",
            "details": "For most people, it is going to be near-impossible to remember hundreds of strong and unique passwords. A password manager is an application that generates, stores, and auto-fills your login credentials for you. All your passwords will be encrypted against 1 master password (which you must remember, and it should be very strong). Most password managers have browser extensions and mobile apps, so whatever device you are on, your passwords can be auto-filled. A good all-rounder is [Bitwarden](https://awesome-privacy.xyz/essentials/password-managers/bitwarden), or see [Recommended Password Managers](https://awesome-privacy.xyz/essentials/password-managers).",
            "status": "To do",
            "result": "Not assessed",
            "observation": "",
            "evidence": ""
          },
          {
            "id": "auth-3",
            "security": "Avoid Sharing Passwords",
            "priority": "Essential",
            "details": "While there may be times that you need to share access to an account with another person, you should generally avoid doing this because it makes it easier for the account to become compromised. If you absolutely do need to share a password — for example, when working on a team with a shared account — this should be done via features built into a password manager.",
            "status": "To do",
            "result": "Not assessed",
            "observation": "",
            "evidence": ""
          },
          {
            "id": "auth-4",
            "security": "Enable 2-Factor Authentication",
            "priority": "Essential",
            "details": "2FA is where you must provide both something you know (a password) and something you have (such as a code on your phone) to log in. This means that if anyone has your password (e.g., through phishing, malware, or a data breach), they will not be able to log into your account. It's easy to get started, download [an authenticator app](https://github.com/Lissy93/awesome-privacy#2-factor-authentication) onto your phone, and then go to your account security settings and follow the steps to enable 2FA. Next time you log in on a new device, you will be prompted for the code that is displayed in the app on your phone (it works without internet, and the code usually changes every 30 seconds).",
            "status": "To do",
            "result": "Not assessed",
            "observation": "",
            "evidence": ""
          },
          {
            "id": "auth-5",
            "security": "Keep Backup Codes Safe",
            "priority": "Essential",
            "details": "When you enable multi-factor authentication, you will usually be given several codes that you can use if your 2FA method is lost, broken, or unavailable. Keep these codes somewhere safe to prevent loss or unauthorized access. You should store these on paper or in a safe place on disk (e.g., in offline storage or an encrypted file/drive). Don't store these in your password manager as 2FA sources and passwords should be kept separately.",
            "status": "To do",
            "result": "Not assessed",
            "observation": "",
            "evidence": ""
          },
          {
            "id": "auth-6",
            "security": "Sign Up for Breach Alerts",
            "priority": "Optional",
            "details": "After a website suffers a significant data breach, the leaked data often ends up on the internet. Several websites collect these leaked records and allow you to search your email address to check if you are in any of their lists. [Firefox Monitor](https://monitor.firefox.com), [Have I Been Pwned](https://haveibeenpwned.com), and [DeHashed](https://dehashed.com) allow you to sign up for monitoring, where they will notify you if your email address appears in any new data sets. It is useful to know as soon as possible when this happens so that you can change your passwords for the affected accounts. [Have i been pwned](https://awesome-privacy.xyz/security-tools/online-tools/have-i-been-pwned) also has domain-wide notification, where you can receive alerts if any email addresses under your entire domain appear (useful if you use aliases for [anonymous forwarding](https://github.com/Lissy93/awesome-privacy#anonymous-mail-forwarding)).",
            "status": "To do",
            "result": "Not assessed",
            "observation": "",
            "evidence": ""
          },
          {
            "id": "auth-7",
            "security": "Shield your Password/PIN",
            "priority": "Optional",
            "details": "When typing your password in public places, ensure you are not in direct line of sight of a CCTV camera and that no one can see over your shoulder. Cover your password or pin code while you type, and do not reveal any plain text passwords on your screen.",
            "status": "To do",
            "result": "Not assessed",
            "observation": "",
            "evidence": ""
          },
          {
            "id": "auth-8",
            "security": "Update Critical Passwords Periodically",
            "priority": "Optional",
            "details": "Database leaks and breaches are common, and, likely, several of your passwords are already somewhere online. Occasionally updating passwords of security-critical accounts can help mitigate this. But providing that all your passwords are long, strong, and unique, there is no need to do this too often — annually should be sufficient. Enforcing mandatory password changes within organisations is [no longer recommended](https://duo.com/decipher/microsoft-will-no-longer-recommend-forcing-periodic-password-changes), as it encourages colleagues to select weaker passwords.",
            "status": "To do",
            "result": "Not assessed",
            "observation": "",
            "evidence": ""
          },
          {
            "id": "auth-9",
            "security": "Don’t Save your Password in Browsers",
            "priority": "Optional",
            "details": "Most modern browsers offer to save your credentials when you log into a site. Don’t allow this, as they are not always encrypted and could allow someone to gain access to your accounts. Instead, use a dedicated password manager to store (and auto-fill) your passwords.",
            "status": "To do",
            "result": "Not assessed",
            "observation": "",
            "evidence": ""
          },
          {
            "id": "auth-10",
            "security": "Avoid Logging In on Someone Else’s Device",
            "priority": "Optional",
            "details": "Avoid logging in on other people's computers since you can't be sure their system is clean. Be especially cautious of public machines, as malware and tracking arr more common here. Using someone else's device is especially dangerous with critical accounts like online banking. When using someone else's machine, ensure that you're in a private/incognito session (Use Ctrl+Shift+N/ Cmd+Shift+N). This will request the browser to not save your credentials, cookies, and browsing history.",
            "status": "To do",
            "result": "Not assessed",
            "observation": "",
            "evidence": ""
          },
          {
            "id": "auth-11",
            "security": "Avoid Password Hints",
            "priority": "Optional",
            "details": "Some sites allow you to set password hints. Often, it is very easy to guess answers. In cases where password hints are mandatory, use random answers and record them in your password manager (`Name of the first school: 6D-02-8B-!a-E8-8F-81`).",
            "status": "To do",
            "result": "Not assessed",
            "observation": "",
            "evidence": ""
          },
          {
            "id": "auth-12",
            "security": "Never Answer Online Security Questions Truthfully",
            "priority": "Optional",
            "details": "If a site asks security questions (such as place of birth, mother's maiden name, or first car, etc.), don't provide real answers. It is a trivial task for hackers to find out this information online or through social engineering. Instead, create a fictitious answer, and store it inside your password manager. Using real words is better than random characters, as [explained here](https://news.ycombinator.com/item?id=29244870).",
            "status": "To do",
            "result": "Not assessed",
            "observation": "",
            "evidence": ""
          },
          {
            "id": "auth-13",
            "security": "Don’t Use a 4-digit PIN",
            "priority": "Optional",
            "details": "Don’t use a short PIN to access your smartphone or computer. Instead, use a text password or a much longer PIN. Numeric passphrases are easy to crack (A 4-digit pin has 10,000 combinations, compared to 7.4 million for a 4-character alpha-numeric code).",
            "status": "To do",
            "result": "Not assessed",
            "observation": "",
            "evidence": ""
          },
          {
            "id": "auth-14",
            "security": "Avoid Using SMS for 2FA",
            "priority": "Optional",
            "details": "When enabling multi-factor authentication, opt for app-based codes or a hardware token if supported. SMS is susceptible to several common threats, such as [SIM-swapping](https://www.maketecheasier.com/sim-card-hijacking) and [interception](https://secure-voice.com/ss7_attacks). There's also no guarantee of how securely your phone number will be stored or what else it will be used for. From a practical point of view, SMS will only work when you have a signal and can be slow. If a website or service requires the usage of an SMS number for recovery, consider purchasing a second pre-paid phone number only used for account recovery for these instances.",
            "status": "To do",
            "result": "Not assessed",
            "observation": "",
            "evidence": ""
          },
          {
            "id": "auth-15",
            "security": "Avoid Using your PM to Generate OTPs",
            "priority": "Advanced",
            "details": "Many password managers are also able to generate 2FA codes. It is best not to use your primary password manager as your 2FA authenticator as well, since it would become a single point of failure if compromised. Instead, use a dedicated [authenticator app](https://github.com/Lissy93/awesome-privacy#2-factor-authentication) on your phone or laptop.",
            "status": "To do",
            "result": "Not assessed",
            "observation": "",
            "evidence": ""
          },
          {
            "id": "auth-16",
            "security": "Avoid Face Unlock",
            "priority": "Advanced",
            "details": "Most phones and laptops offer a facial recognition authentication feature, using the camera to compare a snapshot of your face with a stored hash. It may be very convenient, but there are numerous ways to [fool it](https://www.forbes.com/sites/jvchamary/2017/09/18/security-apple-face-id-iphone-x/) and gain access to the device through digital photos and reconstructions from CCTV footage. Unlike your password, there are likely photos of your face on the internet and videos recorded by surveillance cameras.",
            "status": "To do",
            "result": "Not assessed",
            "observation": "",
            "evidence": ""
          },
          {
            "id": "auth-17",
            "security": "Watch Out for Keyloggers",
            "priority": "Advanced",
            "details": "A hardware [keylogger](https://en.wikipedia.org/wiki/Hardware_keylogger) is a physical device planted between your keyboard and the USB port, which intercepts all keystrokes and sometimes relays data to a remote server. It gives a hacker access to everything typed, including passwords. The best way to stay protected is just by checking your USB connection after your PC has been unattended. It is also possible for keyloggers to be planted inside the keyboard housing, so look for any signs that the case has been tampered with, and consider bringing your own keyboard to work. Data typed on a virtual keyboard, pasted from the clipboard, or auto-filled by a password manager can not be intercepted by a hardware keylogger.",
            "status": "To do",
            "result": "Not assessed",
            "observation": "",
            "evidence": ""
          },
          {
            "id": "auth-18",
            "security": "Consider a Hardware Token",
            "priority": "Advanced",
            "details": "A U2F/FIDO2 security key is a USB (or NFC) device that you insert while logging in to an online service to verify your identity instead of entering a OTP from your authenticator. [SoloKey](https://solokeys.com) and [NitroKey](https://www.nitrokey.com) are examples of such keys. They bring with them several security benefits. Since the browser communicates directly with the device, it cannot be fooled as to which host is requesting authentication because the TLS certificate is checked. [This post](https://security.stackexchange.com/a/71704) is a good explanation of the security of using FIDO U2F tokens. Of course, it is important to store the physical key somewhere safe or keep it on your person. Some online accounts allow for several methods of 2FA to be enabled.",
            "status": "To do",
            "result": "Not assessed",
            "observation": "",
            "evidence": ""
          },
          {
            "id": "auth-19",
            "security": "Consider Offline Password Manager",
            "priority": "Advanced",
            "details": "For increased security, an encrypted offline password manager will give you full control over your data. [KeePass](https://awesome-privacy.xyz/essentials/password-managers/keepass) is a popular choice, with lots of [plugins](https://keepass.info/plugins.html) and community forks with additional compatibility and functionality. Popular clients include: [KeePassXC](https://keepassxc.org) (desktop), [KeePassDX](https://www.keepassdx.com) (Android) and [StrongBox](https://apps.apple.com/us/app/strongbox-password-safe/id897283731) (iOS). The drawback being that it may be slightly less convenient for some, and it will be up to you to back it up and store it securely.",
            "status": "To do",
            "result": "Not assessed",
            "observation": "",
            "evidence": ""
          },
          {
            "id": "auth-20",
            "security": "Consider Unique Usernames",
            "priority": "Advanced",
            "details": "Having different passwords for each account is a good first step, but if you also use a unique username, email, or phone number to log in, then it will be significantly harder for anyone trying to gain unauthorised access. The easiest method for multiple emails, is using auto-generated aliases for anonymous mail forwarding. This is where [anything]@yourdomain.com will arrive in your inbox, allowing you to use a different email for each account (see [Mail Alias Providers](https://github.com/Lissy93/awesome-privacy#mail-forwarding)). Usernames are easier since you can use your password manager to generate, store, and auto-fill these. Virtual phone numbers can be generated through your VOIP provider.",
            "status": "To do",
            "result": "Not assessed",
            "observation": "",
            "evidence": ""
          }
        ],
        "domains": []
      },
      {
        "id": "threat-and-vulnerability-management",
        "title": "Threat and Vulnerability Management",
        "description": "Identifying and mitigating threats.",
        "longDescription": "Proactively identifying, assessing, and mitigating vulnerabilities in authentication systems is essential to defend against evolving threats.",
        "items": [],
        "domains": []
      },
      {
        "id": "continuity",
        "title": "Continuity",
        "description": "Ensuring authentication services are resilient.",
        "longDescription": "Planning for disruptions to authentication services ensures that users can maintain access to critical systems during an incident.",
        "items": [],
        "domains": []
      },
      {
        "id": "supplier-relationships-security",
        "title": "Supplier Relationships Security",
        "description": "Managing third-party authentication risks.",
        "longDescription": "When relying on third-party providers for authentication services, it is crucial to manage the associated security risks through due diligence and contractual agreements.",
        "items": [],
        "domains": []
      },
      {
        "id": "legal-and-compliance",
        "title": "Legal and Compliance",
        "description": "Adhering to authentication regulations.",
        "longDescription": "Ensuring that authentication practices comply with relevant legal, statutory, and regulatory requirements is a critical aspect of information security.",
        "items": [],
        "domains": []
      },
      {
        "id": "information-security-event-management",
        "title": "Information Security Event Management",
        "description": "Responding to authentication incidents.",
        "longDescription": "Having a formal process for managing authentication-related security incidents is key to minimizing their impact and learning from them to prevent recurrence.",
        "items": [],
        "domains": []
      },
      {
        "id": "information-security-assurance",
        "title": "Information Security Assurance",
        "description": "Verifying authentication effectiveness.",
        "longDescription": "Regularly assessing and auditing authentication controls provides assurance that they are implemented correctly and operating effectively.",
        "items": [],
        "domains": []
      },
      {
        "id": "cryptography",
        "title": "Cryptography",
        "description": "Using encryption to protect credentials.",
        "longDescription": "Cryptography is the cornerstone of secure authentication, used to protect passwords in transit and at rest, and to ensure the integrity of authentication messages.",
        "items": [],
        "domains": []
      }
    ]
  },
  {
    "id": "a5--organizational-controls",
    "title": "A.5 – Organizational Controls",
    "description": " Define the organization’s governance, policies, and processes to manage information security systematically.",
    "longDescription": "Organizational controls are the foundation of an Information Security Management System (ISMS). They define how an organization establishes its governance, policies, responsibilities, and processes to manage information security in a structured, consistent, and proactive manner.",
    "iconName": "KeyIcon",
    "color": "#14fa6c",
    "items": [],
    "domains": []
  },
  {
    "id": "a7--physical-controls",
    "title": "People Controls (A.6)",
    "description": "Ensure that employees and contractors understand and fulfill their information security responsibilities.",
    "longDescription": "People controls focus on managing the human factors of information security. They ensure that all individuals involved with the organization are properly screened, trained, and made aware of their security obligations, both during and after employment.",
    "iconName": "GlobeIcon",
    "color": "#f31212",
    "domains": [
      {
        "title": "6.1 Screening",
        "description": "This control ensures that individuals hired or engaged by the organization are trustworthy and suitable for their roles—especially those with access to sensitive information. It helps reduce the risk of insider threats, fraud, or misuse of information assets.",
        "longDescription": "Background verification \nchecks on all candidates to \nbecome personnel shall be \ncarried out prior to joining \nthe organization and on an \nongoing basis taking into \nconsideration applicable \nlaws, regulations and ethics \nand be proportional to the \nbusiness requirements, the \nclassification of the \ninformation to be accessed \nand the perceived risks. ",
        "id": "a7--physical-controls-6.1-screening",
        "items": [
          {
            "id": "a7--physical-controls-6.1-screening-1762449159253",
            "security": "Is there a screening process for onboarding full-time, part-time and temporary staff?",
            "priority": "Optional",
            "details": "Meaning:\nThe assessor is asking whether your organization has a formal, documented process for screening all types of personnel — not just permanent employees, but also:\n\nPart-time staff\n\nTemporary workers\n\nContractors\n\nInterns or consultants\n\nWhat to show/evidence:\n\nHR policy or recruitment policy describing the screening procedure.\n\nWorkflow or checklist for background checks.\n\nDocumentation showing consistent application across all personnel types.",
            "status": "To do",
            "result": "Not assessed",
            "observation": "",
            "evidence": ""
          },
          {
            "id": "a7--physical-controls-6.1-screening-1762449204028",
            "security": "Are background verification checks carried out on all new candidates for employment?",
            "priority": "Optional",
            "details": "This asks whether every new hire goes through a background verification process before employment is finalized.\nIt verifies that no one bypasses the process — even in urgent hiring situations.\n\nWhat to show/evidence:\n\nRecords of completed checks (or a confirmation from the background screening vendor).\n\nHR hiring checklist showing this step.\n\nPolicy mandating background verification before onboarding.",
            "status": "To do",
            "result": "Not assessed",
            "observation": "",
            "evidence": ""
          },
          {
            "id": "a7--physical-controls-6.1-screening-1762449274200",
            "security": "Does the background verification process consider checking professional experience, academic qualifications, independent identity verification, criminal records verification and credit review?",
            "priority": "Advanced",
            "details": "This question tests the scope and depth of the verification process.\nA comprehensive background check typically includes:\n\nProfessional experience: Employment history validation.\n\nAcademic qualifications: Degree/diploma verification.\n\nIdentity verification: Confirming the candidate’s legal identity.\n\nCriminal record check: Ensuring no relevant offenses that would pose risk.\n\nCredit review: (especially for financial or high-trust roles).\n\nWhat to show/evidence:\n\nVendor reports or HR internal forms listing these checks.\n\nPolicy specifying which checks apply to which job roles.\n\nExample anonymized verification results.",
            "status": "To do",
            "result": "Not assessed",
            "observation": "",
            "evidence": ""
          },
          {
            "id": "a7--physical-controls-6.1-screening-1762449320855",
            "security": "Are the checks compliant with relevant laws, regulations and ethics?",
            "priority": "Advanced",
            "details": "The organization must conduct checks legally and ethically. This includes:\n\nFollowing local labor laws and data protection/privacy regulations (e.g., GDPR).\n\nObtaining candidate consent before performing checks.\n\nLimiting the scope of checks to what’s necessary for the role (“proportional to the business requirements”).\n\nWhat to show/evidence:\n\nDocumentation of compliance with local laws.\n\nConsent forms from candidates.\n\nPrivacy policy explaining how candidate data is used and stored.\n\nLegal or compliance team guidance.\n",
            "status": "To do",
            "result": "Not assessed",
            "observation": "",
            "evidence": ""
          }
        ],
        "domains": []
      },
      {
        "title": "6.2 Terms and  conditions of  employment ",
        "description": "The employment  contractual agreements  shall state the personnel’s  and the organization’s  responsibilities for  information security.",
        "longDescription": "s",
        "id": "a7--physical-controls-terms-and-conditions-of-employment-",
        "items": [
          {
            "id": "a7--physical-controls-terms-and-conditions-of-employment--1763051352887",
            "security": "Is there a formal terms and conditions of employment documented and communicated to all full-time, part-time, and temporary staff before onboarding?",
            "priority": "Essential",
            "details": "The assessor wants to confirm that your organization has a formal, documented employment contract or agreement that outlines the terms and conditions for every category of employee — full-time, part-time, temporary, and contractual — and that it is communicated and signed before joining.",
            "status": "To do",
            "result": "Not assessed",
            "observation": "What to show / Evidence:\n\nHR or onboarding policy requiring contracts before start date\n\nSigned employment contracts (sample copies)\n\nOffer letter templates referencing employment terms\n\nOnboarding checklist or HRIS record showing acknowledgment",
            "evidence": ""
          },
          {
            "id": "a7--physical-controls-terms-and-conditions-of-employment--1763051633564",
            "security": "Do the terms and conditions of employment include the organization’s Information Security Policy and relevant topic-specific policies?",
            "priority": "Essential",
            "details": "The assessor checks if the employment contract or onboarding process introduces and binds personnel to comply with the organization’s information security policy, including related policies such as Acceptable Use, Data Protection, or Confidentiality.",
            "status": "To do",
            "result": "Not assessed",
            "observation": "What to show / Evidence:\n\nEmployment contract referencing Information Security Policy\n\nEmployee handbook or induction materials with policy links\n\nSigned acknowledgment of policy receipt or awareness training completion",
            "evidence": ""
          },
          {
            "id": "a7--physical-controls-terms-and-conditions-of-employment--1763051695929",
            "security": "Do the terms and conditions of employment include legal responsibilities and rights such as copyright laws or data protection legislations?",
            "priority": "Essential",
            "details": "The assessor wants to ensure the organization’s employment documentation includes legal clauses covering intellectual property rights, copyright protection, and compliance with applicable data protection laws (like GDPR, IT Act, etc.).",
            "status": "To do",
            "result": "Not assessed",
            "observation": "What to show / Evidence:\n\nEmployment contract sections on confidentiality and intellectual property\n\nSigned NDA (Non-Disclosure Agreement)\n\nLegal review or HR policy referencing data protection obligations",
            "evidence": ""
          },
          {
            "id": "a7--physical-controls-terms-and-conditions-of-employment--1763051824798",
            "security": "Do the terms and conditions of employment include responsibilities for the handling of information received from interested parties?",
            "priority": "Advanced",
            "details": "The assessor checks whether employees are contractually obligated to protect and correctly handle information from customers, suppliers, and partners (interested parties).",
            "status": "To do",
            "result": "Not assessed",
            "observation": "What to show / Evidence:\n\nContract clauses on confidentiality of third-party data\n\nNDA or code of conduct referencing external information protection\n\nSupplier/customer data handling procedures in HR documentation",
            "evidence": ""
          },
          {
            "id": "a7--physical-controls-terms-and-conditions-of-employment--1763051887336",
            "security": "Do the terms and conditions of employment include actions to be taken if personnel disregard the organization’s security requirements?",
            "priority": "Essential",
            "details": "The assessor checks whether the organization clearly defines disciplinary actions or sanctions for employees who violate information security or company policies.",
            "status": "To do",
            "result": "Not assessed",
            "observation": "What to show / Evidence:\n\nEmployment contract or HR manual section on disciplinary procedures\n\nSecurity policy mentioning consequences for violations\n\nHR records showing examples of policy enforcement (if applicable)",
            "evidence": ""
          }
        ],
        "domains": []
      },
      {
        "title": "6.3 Information  security  awareness,  education and  training",
        "description": "Personnel of the  organization and relevant  interested parties shall  receive appropriate  information security  awareness, education and  training and regular  updates of the  organization's information  security policy, topic specific policies and  procedures, as relevant for  their job function.",
        "longDescription": "",
        "id": "a7--physical-controls-6.3-information-security-awareness,-education-and-training",
        "items": [
          {
            "id": "a7--physical-controls-6.3-information-security-awareness,-education-and-training-1763052107961",
            "security": "Do all employees, contractors, and third-party users undergo regular information security awareness training appropriate to their role and function within the organization?",
            "priority": "Essential",
            "details": "The assessor is checking whether the organization has implemented a formal, ongoing information security awareness and training program for all personnel — including full-time staff, contractors, and external parties — that matches their job responsibilities and risk exposure.",
            "status": "To do",
            "result": "Not assessed",
            "observation": "What to show / Evidence:\n\nAnnual or periodic security awareness training calendar.\n\nAttendance logs or completion records for all employees and third parties.\n\nRole-based training materials (e.g., admin, developer, HR-specific modules).\n\nEvidence of refresher training (e.g., phishing simulation reports, awareness campaigns).",
            "evidence": ""
          },
          {
            "id": "a7--physical-controls-6.3-information-security-awareness,-education-and-training-1763052181489",
            "security": "Does the information security awareness program cover the organization’s information security policy and topic-specific policies, as well as applicable standards, laws, regulations, contracts, and agreements?",
            "priority": "Essential",
            "details": "The assessor wants to ensure that the awareness program educates employees about the organization’s policies and legal obligations, ensuring personnel understand both internal rules and external compliance requirements that apply to their work.",
            "status": "To do",
            "result": "Not assessed",
            "observation": "What to show / Evidence:\n\nTraining materials or slide decks covering InfoSec policies and legal compliance.\n\nPolicy acknowledgment forms signed by staff.\n\nTraining syllabus referencing laws, standards, or contracts.\n\nRecord of updates when new regulations or policies are introduced.",
            "evidence": ""
          },
          {
            "id": "a7--physical-controls-6.3-information-security-awareness,-education-and-training-1763052296495",
            "security": "Does the information security awareness program include training on personal accountability and individual responsibilities for protecting organizational and third-party information?",
            "priority": "Advanced",
            "details": "The assessor is checking if personnel are trained to understand that information security is everyone’s responsibility — including how their own actions or inactions can lead to security incidents.",
            "status": "To do",
            "result": "Not assessed",
            "observation": "What to show / Evidence:\n\nAwareness content on “individual responsibility” or “secure behavior.”\n\nExamples of role-specific security practices (e.g., password hygiene, data handling).\n\nSigned declarations or acknowledgment forms from employees.\n\nInternal communications reinforcing security culture (emails, posters, intranet messages).",
            "evidence": ""
          },
          {
            "id": "a7--physical-controls-6.3-information-security-awareness,-education-and-training-1763052366885",
            "security": "Does the organization have a formal process to assess the effectiveness of the information security awareness program (e.g., through quizzes, phishing simulations, or post-training evaluations)? ",
            "priority": "Advanced",
            "details": "The assessor wants to verify that the organization not only delivers training but also measures its effectiveness — ensuring employees understand and apply what they’ve learned.",
            "status": "To do",
            "result": "Not assessed",
            "observation": "What to show / Evidence:\n\nPost-training quiz or assessment results.\n\nMetrics from phishing awareness campaigns or scenario-based testing.\n\nFeedback forms or surveys on training sessions.\n\nAwareness KPI reports shared with management.",
            "evidence": ""
          }
        ],
        "domains": []
      },
      {
        "title": "6.4 Disciplinary  process ",
        "description": "A disciplinary process shall  be formalized and  communicated to take  actions against personnel  and other relevant  interested parties who have  committed an information  security policy violation. ",
        "longDescription": "",
        "id": "a7--physical-controls-disciplinary-process-",
        "items": [
          {
            "id": "a7--physical-controls-disciplinary-process--1763100006475",
            "security": "Is there a formal disciplinary process that allows the organization to take action against employees who commit an information security breach?",
            "priority": "Essential",
            "details": "The assessor is checking whether the organization has a documented disciplinary policy that defines how violations of information security policies are handled.\n\nThe process should clearly explain:\n\nWhat constitutes a security breach\n\nTypes of disciplinary actions\n\nEscalation levels\n\nRoles and responsibilities for investigation and action",
            "status": "To do",
            "result": "Not assessed",
            "observation": "What to show / Evidence:\n\nDocumented disciplinary policy or HR manual\n\nSection of employment contract referencing disciplinary actions\n\nRecords of past disciplinary actions (if applicable)",
            "evidence": ""
          },
          {
            "id": "a7--physical-controls-disciplinary-process--1763100073663",
            "security": "Is the formal disciplinary process approved by top management?",
            "priority": "Advanced",
            "details": "The assessor wants to confirm that the disciplinary process has official endorsement from senior leadership, which shows commitment to enforcing information security requirements.",
            "status": "To do",
            "result": "Not assessed",
            "observation": "What to show / Evidence:\n\nPolicy approval page with signatures of top management\n\nChange approval logs\n\nManagement review minutes confirming approval",
            "evidence": ""
          },
          {
            "id": "a7--physical-controls-disciplinary-process--1763100116487",
            "security": "Is the formal disciplinary process communicated to all employees?",
            "priority": "Optional",
            "details": "The assessor checks whether employees are made aware of the disciplinary measures and the consequences of violating security policies.\n\nCommunication should occur through:\n\nOnboarding\n\nEmail broadcasts\n\nPolicy acknowledgment\n\nEmployee handbook\n\nAwareness training",
            "status": "To do",
            "result": "Not assessed",
            "observation": "What to show / Evidence:\n\nTraining attendance records\n\nSigned policy acknowledgments\n\nEmployee handbook containing the disciplinary process\n\nIntranet or HR portal communication",
            "evidence": ""
          },
          {
            "id": "a7--physical-controls-disciplinary-process--1763100201882",
            "security": "Does the formal disciplinary process consider relevant factors before taking action?",
            "priority": "Optional",
            "details": "The assessor is verifying whether the disciplinary process is fair, consistent, and proportional, taking into consideration multiple elements of the security breach.\n\nThe process should evaluate:\n\nNature of the breach (who, what, when, how)\n\nGravity of the breach and its consequences\n\nIntentional vs. unintentional behaviour\n\nFirst-time or repeated offence\n\nWhether the violator was properly trained and informed\n\nImpact on organization or interested parties\n\nLevel of negligence or malicious intent",
            "status": "To do",
            "result": "Not assessed",
            "observation": "What to show / Evidence:\n\nPolicy sections outlining assessment factors\n\nCase records showing applied considerations\n\nInvestigation templates or checklists",
            "evidence": ""
          }
        ],
        "domains": []
      },
      {
        "title": "6.5 Responsibilities After Termination or Change of Employment",
        "description": "Information security  responsibilities and duties  that remain valid after  termination or change of  employment shall be  defined, enforced and  communicated to relevant  personnel and other  interested parties. ",
        "longDescription": "",
        "id": "a7--physical-controls-6.5-responsibilities-after-termination-or-change-of-employment",
        "items": [
          {
            "id": "a7--physical-controls-6.5-responsibilities-after-termination-or-change-of-employment-1763100625019",
            "security": "Does the employee termination process define the information security responsibilities and duties that remain valid after termination or change of job role for all full-time, part-time, and temporary staff?",
            "priority": "Basic",
            "details": "The assessor is verifying whether the organization has a formal and documented offboarding process that ensures personnel understand what information security duties continue even after they leave the organization or change roles.\n\nThese ongoing responsibilities include:\n\nContinuing confidentiality obligations\n\nNon-disclosure of sensitive or proprietary information\n\nReturning all organizational assets (laptop, ID card, access tokens, documents)\n\nRemoval of access rights immediately after termination\n\nProtecting customer/supplier information even after exit",
            "status": "To do",
            "result": "Not assessed",
            "observation": "What to show / Evidence:\n\nOffboarding/exit procedure in HR or ISMS documentation\n\nExit clearance checklist including InfoSec responsibilities\n\nRecords proving timely access revocation\n\nTermination workflow documents from HRMS system",
            "evidence": ""
          },
          {
            "id": "a7--physical-controls-6.5-responsibilities-after-termination-or-change-of-employment-1763100675019",
            "security": "Are the responsibilities and duties that remain valid after termination of employment or contract included in the individual’s terms and conditions of employment, contract, or agreement?",
            "priority": "Essential",
            "details": "The assessor wants to confirm that employees and contractors are contractually bound to maintain confidentiality and protect organizational and third-party information even after they leave the organization.\n\nThese obligations should be formally stated in:\n\nEmployment contracts\n\nConsultant/contractor agreements\n\nNon-Disclosure Agreements (NDAs)\n\nIP protection and confidentiality clauses\n\nTerms and conditions of employment or assignment",
            "status": "To do",
            "result": "Not assessed",
            "observation": "What to show / Evidence:\n\nEmployment contract section on post-termination obligations\n\nNDA signed at the time of joining\n\nContractor agreements with confidentiality terms\n\nExit acknowledgment or certification form confirming awareness",
            "evidence": ""
          }
        ],
        "domains": []
      },
      {
        "title": "6.6 Confidentiality or Non-Disclosure Agreements (NDAs)",
        "description": "Confidentiality or non disclosure agreements  reflecting the organization’s  needs for the protection of  information should be  identified, documented,  regularly reviewed and  signed by personnel and  other relevant interested  parties.",
        "longDescription": "",
        "id": "a7--physical-controls-6.6-confidentiality-or-non-disclosure-agreements-(ndas)",
        "items": [
          {
            "id": "a7--physical-controls-6.6-confidentiality-or-non-disclosure-agreements-(ndas)-1763100862560",
            "security": "Are all full-time, part-time, and temporary staff required to sign a confidentiality or non-disclosure agreement (NDA) prior to gaining access to the organization’s confidential information and associated assets?",
            "priority": "Advanced",
            "details": "The assessor is verifying whether the organization ensures that no employee or contractor is given access to sensitive, confidential, or proprietary information before signing a formal NDA or confidentiality clause.\n\nThis includes:\n\nNew hires (full-time, part-time, interns, temporary workers)\n\nContractors and third-party personnel\n\nConsultants with system or data access\n\nThe NDA must be signed before access to systems, networks, or data is provided.",
            "status": "To do",
            "result": "Not assessed",
            "observation": "What to show / Evidence:\n\nNDA templates used by HR or Legal\n\nSigned NDA forms for a sample of employees\n\nContract agreements containing confidentiality clauses\n\nOnboarding checklist proving NDA is completed before access provisioning",
            "evidence": ""
          },
          {
            "id": "a7--physical-controls-6.6-confidentiality-or-non-disclosure-agreements-(ndas)-1763100899128",
            "security": "Do the confidentiality or non-disclosure agreements include the required elements, such as:  Definition of the information to be protected  Validity period of the agreement  Ownership of information, trade secrets, and intellectual property  Terms for returning or destroying information upon termination?",
            "priority": "Basic",
            "details": "Meaning:\nThe assessor is checking whether the NDA is comprehensive and legally enforceable, and whether it clearly outlines each party’s obligations regarding confidential information.\n\nA complete NDA should include:\n\nDescription of protected information (e.g., business data, customer info, IP, credentials)\n\nDuration/validity (e.g., obligations continue after employment ends)\n\nOwnership clauses for information, trade secrets, and intellectual property\n\nReturn or destruction obligations for documents, equipment, or digital assets at exit\n\nConsequences for breach of confidentiality\n\nRestrictions on unauthorized sharing or disclosure",
            "status": "To do",
            "result": "Not assessed",
            "observation": "What to show / Evidence:\n\nNDA document with all required clauses\n\nLegal review or version history proving regular updates\n\nSigned copies for employees, contractors, and vendors\n\nExit checklist showing return/destruction of information at termination",
            "evidence": ""
          }
        ],
        "domains": []
      },
      {
        "title": "6.7 Remote  working ",
        "description": "Security measures shall be  implemented when  personnel are working  remotely to protect  information accessed,  processed or stored outside  the organization’s premises.",
        "longDescription": "",
        "id": "a7--physical-controls-6.7-remote-working-",
        "items": [
          {
            "id": "a7--physical-controls-6.7-remote-working--1763101143706",
            "security": "Is there a formal, documented policy that defines the information security requirements for allowing personnel to work remotely and access the organization’s information?",
            "priority": "Advanced",
            "details": "The assessor is verifying whether the organization has an officially approved and published Remote Working Policy that clearly states the conditions, controls, and security measures required for accessing corporate information outside the organization’s premises.\n\nA formal Remote Working Policy should:\n\nDefine who is permitted to work remotely\n\nList security requirements such as VPN, MFA, encryption, secure Wi-Fi\n\nSpecify acceptable use rules for devices and remote access\n\nInclude physical security expectations (private workspace, lockable storage, no sharing of devices)\n\nDefine handling, storage, printing, and disposal rules for sensitive information\n\nEstablish responsibilities of employees when working from home or public places\n\nBe reviewed regularly and approved by top management",
            "status": "To do",
            "result": "Not assessed",
            "observation": "What to Show / Evidence\n\nOfficial Remote Working Policy document (PDF or online copy)\n\nApproval records from top management\n\nPolicy communication records to employees (emails, LMS, HR onboarding documents)\n\nEmployee acknowledgment logs or digital signatures\nX`\nVersion history showing policy updates and reviews",
            "evidence": ""
          },
          {
            "id": "a7--physical-controls-6.7-remote-working--1763101309884",
            "security": "Is the remote working policy formally approved by top management before being implemented and communicated?",
            "priority": "Optional",
            "details": "The assessor wants to confirm that the Remote Working Policy has received official authorization from the organization’s top management, ensuring:\n\nThe policy aligns with business goals\n\nManagement accepts responsibility for enforcing it\n\nAdequate resources are allocated to support its requirements\n\nThe policy carries organizational authority and is not an informal or draft document\n\nTop management approval demonstrates that:\n\nThe policy is recognized as mandatory\n\nIt supports ISO 27001 governance requirements\n\nEmployees must comply with its rules and controls\n\nApproval typically includes signatures, email confirmations, or governance meeting minutes.",
            "status": "To do",
            "result": "Not assessed",
            "observation": "What to Show / Evidence\n\nApproved policy document with management signatures/date\n\nBoard or management meeting minutes showing approval\n\nEmail or memo from leadership confirming policy adoption\n\nDocument control records showing version approval\n\nPolicy management system logs showing “Approved” status",
            "evidence": ""
          },
          {
            "id": "a7--physical-controls-6.7-remote-working--1763101404025",
            "security": "Is the remote working policy formally communicated to all full-time, part-time, and temporary staff who work remotely?",
            "priority": "Optional",
            "details": "The assessor is checking whether the organization ensures that every individual who works remotely—regardless of their employment type—receives, understands, and acknowledges the Remote Working Policy.\n\nThis ensures:\n\nAll remote workers are aware of security requirements\n\nNo personnel are operating without proper guidance\n\nPolicy expectations, responsibilities, and restrictions are clearly understood\n\nCompliance is maintained uniformly across the organization\n\nCommunication should be done before remote access is granted.\n\nEffective communication may include:\n\nEmail distribution\n\nHR onboarding workflows\n\nLearning Management System (LMS) modules\n\nInternal portals or document management systems\n\nMandatory acknowledgments or digital signatures",
            "status": "To do",
            "result": "Not assessed",
            "observation": "What to Show / Evidence\n\nEmail communication logs or announcements\n\nLMS training completion reports\n\nHR onboarding checklists including policy acknowledgment\n\nSigned acknowledgment forms (HR, DMS, or digital signatures)\n\nEvidence that part-time, temporary, and contractual staff also received the policy",
            "evidence": ""
          },
          {
            "id": "a7--physical-controls-6.7-remote-working--1763101492091",
            "security": "Does the remote working policy include physical security requirements to ensure protection of organizational information at remote work locations?",
            "priority": "Optional",
            "details": "The assessor wants to verify whether the Remote Working Policy clearly defines physical security expectations for employees working outside the organization’s premises.\n\nThis ensures that sensitive information remains protected even when personnel work from:\n\nHome offices\n\nClient locations\n\nShared coworking spaces\n\nPublic environments (hotels, cafés, airports)\n\nThe policy should address:\n\nMaintaining a secure, private workspace\n\nPreventing unauthorized individuals from viewing or accessing information\n\nUsing lockable storage (cabinets, drawers) for documents\n\nEnsuring devices are not left unattended\n\nProtecting screens from shoulder surfing in public places\n\nSecure handling of physical documents (no printing in insecure areas)\n\nSafe transport of notebooks, files, and media between locations\n\nThese controls prevent physical theft, accidental exposure, or unauthorized access.",
            "status": "To do",
            "result": "Not assessed",
            "observation": "What to Show / Evidence\n\nRemote Working Policy document with a dedicated “Physical Security” section\n\nGuidelines for secure workspaces (home office setup requirements)\n\nClear desk and clear screen rules\n\nEmployee onboarding material highlighting physical security expectations\n\nAwareness training slides or LMS modules covering physical security\n\nEvidence of reminders or periodic communications sent to remote staff",
            "evidence": ""
          },
          {
            "id": "a7--physical-controls-6.7-remote-working--1763101722822",
            "security": " Does the remote working policy  consider of the remote working site  such as lockable filing cabinets, secure  transportation between locations and  rules for remote access, clear desk,  printing and disposal of information. ",
            "priority": "Advanced",
            "details": "The assessor is checking whether the organization’s Remote Working Policy clearly defines how information should be protected at the remote work location—both physically and operationally.\n\nA strong policy should include guidance on:\n\n1. Secure Storage:\n\nUse of lockable filing cabinets or drawers\n\nNo sensitive documents left in open or shared spaces\n\nSecure storage for laptops, removable media, and printed materials\n\n2. Secure Transportation:\n\nSafe movement of files and devices between office and home\n\nUse of sealed folders/bags\n\nAvoiding unattended equipment during travel\n\n3. Remote Access Requirements:\n\nUse of VPN, MFA, encryption, and approved devices only\n\nNo use of personal, public, or shared systems for corporate data\n\n4. Clear Desk & Clear Screen:\n\nScreens locked when away\n\nSensitive items cleared from the desk when not in use\n\nProtection from shoulder surfing or observers\n\n5. Printing Controls:\n\nPrinting allowed only when necessary\n\nUse of home printers secured from shared access\n\nNo printing in public or coworking spaces\n\n6. Disposal of Information:\n\nShredding or secure destruction of physical documents\n\nFollowing approved disposal procedures for sensitive material\n\nNo disposal via home or public trash bins\n\nThis ensures that sensitive data is not exposed through poor remote handling practices.",
            "status": "To do",
            "result": "Not assessed",
            "observation": "What to Show / Evidence\n\nSections in the Remote Working Policy covering storage, transport, access, clear desk, and disposal\n\nSecure workspace guidelines or setup checklists\n\nEmployee awareness training content addressing information handling at home\n\nEvidence of periodic reminders or internal communications\n\nDocumentation that employees acknowledged these requirements\n\nPhotos or self-attestation forms (if implemented) showing secure home workspace setup",
            "evidence": ""
          },
          {
            "id": "a7--physical-controls-6.7-remote-working--1763101886210",
            "security": "Does the remote working policy include communications security requirements, ensuring that all data transmitted from remote locations is protected from interception, tampering, or unauthorized access?",
            "priority": "Advanced",
            "details": "The assessor is checking whether the Remote Working Policy defines clear rules and security controls for how employees should communicate and access organizational information while working remotely.\n\nA robust remote communications security section should include:\n\n1. Secure Connection Requirements\n\nMandatory VPN usage\n\nEncrypted communication channels (HTTPS, TLS-encrypted email, encrypted messaging tools)\n\nProhibition of insecure or open Wi-Fi networks\n\n2. Authentication Controls\n\nMandatory MFA for remote access\n\nStrong password policies\n\nDevice identity verification (trusted devices only)\n\n3. Network Security Controls\n\nUse of organization-approved firewalls, endpoint protection, and anti-malware tools\n\nBlocking of unauthorized or risky communication applications\n\nRestrictions on peer-to-peer tools, public proxies, or anonymous networks\n\n4. Email & Messaging Security\n\nRules on sending sensitive data (encryption, approval, classification)\n\nProhibition of personal email or consumer messaging apps for work content\n\n5. Secure Use of Collaboration Tools\n\nGuidelines for video conferencing (waiting rooms, no public meeting links)\n\nRestrictions on file sharing platforms unless approved (e.g., SharePoint, OneDrive)\n\nThese requirements ensure that information remains confidential, authenticated, and protected in transit, even outside the corporate network.",
            "status": "To do",
            "result": "Not assessed",
            "observation": "What to Show / Evidence\n\nRemote Working Policy with a dedicated Communications Security section\n\nVPN, MFA, and endpoint protection enforcement records\n\nNetwork usage guidelines or acceptable use policies\n\nEmail security guidelines and classification rules\n\nScreenshots or logs showing secure communication tools in use\n\nEmployee training material related to communication security",
            "evidence": ""
          },
          {
            "id": "a7--physical-controls-6.7-remote-working--1763101956364",
            "security": "Does the remote working policy address the risk of unauthorized access to information or resources when employees work in public locations (e.g., cafés, airports, coworking spaces)?",
            "priority": "Optional",
            "details": "The assessor is verifying whether the organization has defined how employees should protect sensitive information when working in public or semi-public environments where strangers may be able to observe or access data.\n\nA strong policy should include:\n\n1. Screen Protection:\n\nMandatory use of screen privacy filters\n\nProhibition of working with sensitive information in open public areas\n\nRequirement to lock the screen when stepping away\n\n2. Physical Awareness:\n\nAvoiding shoulder surfing or visibility to nearby individuals\n\nKeeping devices within reach at all times\n\nNot leaving laptops or documents unattended\n\n3. Public Network Risks:\n\nAvoiding public Wi-Fi or mandatory use of VPN when unavoidable\n\nNo direct access to corporate apps without secure channels\n\nRestrictions on using unknown or untrusted networks\n\n4. Audio/Conversation Security:\n\nAvoid discussing confidential topics in public\n\nUse of headsets instead of speakerphones\n\nAwareness of surroundings during calls or meetings\n\n5. Handling of Documents and Devices:\n\nNo printing or reading sensitive documents in public\n\nSecurely carrying laptops and files using protective bags\n\nNo disposal of documents in public areas\n\nThese controls minimize the risk of accidental exposure or malicious access in public zones.",
            "status": "To do",
            "result": "Not assessed",
            "observation": "What to Show / Evidence\n\nRemote Working Policy section addressing public place usage\n\nClear guidelines in Acceptable Use or BYOD policies\n\nAwareness training modules covering risks of public working\n\nCommunication reminders sent to employees\n\nEmployee acknowledgment or compliance tracking",
            "evidence": ""
          },
          {
            "id": "a7--physical-controls-6.7-remote-working--1763102016948",
            "security": "Does the remote working policy require the use of security measures such as firewalls, anti-malware tools, endpoint protection, and other defensive controls on devices used for remote access?",
            "priority": "Advanced",
            "details": "The assessor is checking whether the Remote Working Policy ensures that all devices used for remote work—whether company-issued or approved personal devices—have appropriate baseline security protections.\n\nA comprehensive policy should require:\n\n1. Firewalls:\n\nEnabled host-based firewalls on all work devices\n\nBlocking unauthorized inbound/outbound connections\n\nRestricting access to untrusted networks\n\n2. Anti-Malware & Endpoint Protection:\n\nMandatory installation of organization-approved anti-malware tools\n\nReal-time protection and regular scanning\n\nProhibition of disabling security controls without authorization\n\n3. Security Updates & Patching:\n\nUp-to-date OS and application patches\n\nAutomatic updates enabled\n\nRegular compliance checks by IT or security teams\n\n4. Device Hardening:\n\nFull disk encryption\n\nUSB and external media restrictions\n\nApplication whitelisting or zero-trust endpoint controls\n\n5. Network Security:\n\nEnforced secure configurations for home routers (e.g., WPA3, strong passwords)\n\nProhibiting outdated or insecure network equipment\n\nThese controls reduce risks of malware infections, data breaches, or unauthorized access when accessing corporate resources remotely.",
            "status": "To do",
            "result": "Not assessed",
            "observation": "What to Show / Evidence\n\nRemote Working Policy document highlighting firewall and anti-malware requirements\n\nEndpoint protection deployment reports\n\nDevice compliance logs (MDM, EDR, or AV dashboards)\n\nScreenshots or logs showing firewall and EDR tools installed\n\nPatch management reports for remote endpoints\n\nAwareness training materials for secure device usage",
            "evidence": ""
          }
        ],
        "domains": []
      },
      {
        "title": "6.8 Information  security event  reporting",
        "description": "The organization shall  provide a mechanism for  personnel to report  observed or suspected  information security events  through appropriate  channels in a timely  manner.",
        "longDescription": "",
        "id": "a7--physical-controls-6.8-information-security-event-reporting",
        "items": [
          {
            "id": "a7--physical-controls-6.8-information-security-event-reporting-1763102140041",
            "security": "Are all full-time, part-time, and temporary staff made aware of their responsibility to report observed or suspected information security events?",
            "priority": "Optional",
            "details": "The assessor is checking whether personnel understand that reporting security events is mandatory, not optional.\nThis includes events like:\n\nSuspicious emails or phishing attempts\n\nUnauthorized system access\n\nLost/stolen devices\n\nMalware infections\n\nAccidental data exposure\n\nPolicy violations\n\nThe organization must ensure every individual knows they are personally accountable for reporting these events promptly.\n\nAwareness may come through:\n\nSecurity training\n\nEmployee handbooks\n\nPolicy documents\n\nOnboarding programs\n\nInternal communications (email, portal, posters)",
            "status": "To do",
            "result": "Not assessed",
            "observation": "What to Show / Evidence\n\nISMS policies referencing reporting responsibilities\n\nSecurity awareness training content\n\nTraining attendance or completion reports\n\nHR onboarding documents emphasizing reporting duties\n\nCommunication logs reminding employees of reporting responsibility",
            "evidence": ""
          },
          {
            "id": "a7--physical-controls-6.8-information-security-event-reporting-1763102192345",
            "security": "Are all full-time, part-time, and temporary staff made aware of the procedure for reporting information security events?",
            "priority": "Advanced",
            "details": "The assessor is verifying if employees know how to report an incident—not just that they should report it.\n\nA documented reporting procedure should include:\n\nSteps to follow when an event is detected\n\nInitial containment actions (if applicable)\n\nWhom to contact (team/role)\n\nWhat information to include in the report\n\nTimelines (e.g., report immediately or within X hours)\n\nEscalation flow in case the primary contact is unavailable\n\nProcedure should be available and accessible to everyone.",
            "status": "To do",
            "result": "Not assessed",
            "observation": "What to Show / Evidence\n\nDocumented incident reporting procedure\n\nIncident response plan with reporting workflow\n\nTraining content explaining event reporting steps\n\nOnboarding checklist including reporting procedure\n\nInternal portal/screenshots where procedure is published",
            "evidence": ""
          },
          {
            "id": "a7--physical-controls-6.8-information-security-event-reporting-1763102226619",
            "security": "Are all full-time, part-time, and temporary staff made aware of the communication contact details and communication medium for reporting security events?",
            "priority": "Optional",
            "details": "The assessor is ensuring that personnel know exactly where and how to report incidents, such as:\n\nCommunication channels may include:\n\nDedicated incident reporting email (e.g., security@company.com\n)\n\nHotline or emergency phone number\n\nTicketing system (e.g., ServiceNow, Jira)\n\nSecurity operations portal or form\n\nReporting via line manager (if part of the process)\n\nEmployees must know:\n\nWho receives these reports\n\nWhich channels are primary vs. secondary\n\nWhen to use each method (e.g., urgent phone call vs. normal ticket)\n\nThis ensures quick, consistent, and reliable reporting.",
            "status": "To do",
            "result": "Not assessed",
            "observation": "What to Show / Evidence\n\nPolicy or guidelines listing reporting contacts\n\nPosters, emails, or intranet pages with reporting details\n\nOnboarding materials showing communication channels\n\nAwareness campaigns or reminders\n\nIncident response plan with contact directory",
            "evidence": ""
          }
        ],
        "domains": []
      }
    ]
  },
  {
    "id": "physical-controls-a7",
    "title": "Physical Controls (A.7)",
    "description": "Protect physical environments and assets from unauthorized access, damage, or interference.",
    "longDescription": "Physical controls ensure that facilities, systems, and equipment are protected from physical threats such as theft, fire, or environmental damage. They establish secure perimeters, control access to buildings and rooms, and safeguard infrastructure to maintain confidentiality, integrity, and availability of information.",
    "iconName": "MessageSquareIcon",
    "color": "#fa14d4",
    "items": [],
    "domains": []
  },
  {
    "id": "technological-controls-a8",
    "title": "Technological Controls (A.8)",
    "description": "Implement technical safeguards to protect systems, networks, and data from unauthorized access, misuse, or disruption.",
    "longDescription": "Technological controls apply technical measures to secure information systems, networks, and data against threats. These include access management, malware protection, encryption, system configuration, and continuous monitoring to ensure confidentiality, integrity, and availability of information.",
    "iconName": "Share2Icon",
    "color": "#14fac1",
    "items": [],
    "domains": []
  }
]