[
  {
    "id": "auth",
    "title": "Authentication",
    "description": "Securing your online account login credentials",
    "longDescription": "Most reported data breaches are caused by the use of weak, default, or stolen passwords. This section covers best practices for passwords, multi-factor authentication, and secure login habits, organized into specific security domains.",
    "iconName": "KeyIcon",
    "color": "#facc15",
    "domains": [
      {
        "id": "governance",
        "title": "Governance",
        "description": "Policies and procedures for authentication.",
        "longDescription": "Establishing a strong governance framework for authentication ensures that policies are consistently applied, roles are clearly defined, and the overall strategy aligns with business objectives.",
        "items": []
      },
      {
        "id": "asset-management",
        "title": "Asset Management",
        "description": "Managing assets related to authentication.",
        "longDescription": "Properly managing authentication-related assets, such as password databases and hardware tokens, is crucial for maintaining security and accountability throughout their lifecycle.",
        "items": []
      },
      {
        "id": "information-protection",
        "title": "Information Protection",
        "description": "Protecting authentication information.",
        "longDescription": "This domain focuses on the technical controls and processes required to protect sensitive authentication data, like password hashes and biometric information, from unauthorized access or disclosure.",
        "items": []
      },
      {
        "id": "human-resource-security",
        "title": "Human Resource Security",
        "description": "Managing user access throughout employment.",
        "longDescription": "Integrating authentication management with HR processes ensures that access is granted, modified, and revoked in a timely manner as employees join, change roles, or leave the organization.",
        "items": []
      },
      {
        "id": "physical-security",
        "title": "Physical Security",
        "description": "Securing physical authentication tokens.",
        "longDescription": "This domain covers the measures needed to protect physical authentication factors, such as smart cards, hardware tokens, and the facilities where critical authentication systems are housed.",
        "items": []
      },
      {
        "id": "system-and-network-security",
        "title": "System and Network Security",
        "description": "Securing systems that handle authentication.",
        "longDescription": "Ensuring the underlying systems and networks that process authentication requests are secure is fundamental to preventing credential theft and unauthorized access.",
        "items": []
      },
      {
        "id": "application-security",
        "title": "Application Security",
        "description": "Secure authentication in applications.",
        "longDescription": "This domain focuses on implementing secure authentication mechanisms within applications, including session management, password policies, and protection against common attacks like credential stuffing.",
        "items": []
      },
      {
        "id": "secure-configuration",
        "title": "Secure Configuration",
        "description": "Hardening authentication services.",
        "longDescription": "Properly configuring authentication services, such as directory services and single sign-on platforms, is critical to eliminate vulnerabilities and enforce security policies.",
        "items": []
      },
      {
        "id": "identity-and-access-management",
        "title": "Identity and Access Management",
        "description": "Core principles of user authentication.",
        "longDescription": "The core of authentication security. Use long, strong, and unique passwords, manage them in a secure password manager, enable 2-factor authentication, keep on top of breaches, and take care while logging into your accounts.",
        "items": [
          { "id": "auth-0", "security": "Use a Strong Password", "priority": "Essential", "details": "If your password is too short, or contains dictionary words, places, or names, then it can be easily cracked through brute force or guessed by someone. The easiest way to make a strong password is by making it long (12+ characters) — consider using a 'passphrase' made up of many words. Alternatively, use a password generator to create a long, strong random password. Have a play with [Security.org's How Secure Is My Password?](https://security.org/how-secure-is-my-password/), to get an idea of how quickly common passwords can be cracked. Read more about creating strong passwords: [securityinabox.org](https://securityinabox.org/en/passwords/passwords-and-2fa/)." },
          { "id": "auth-1", "security": "Don't Reuse Passwords", "priority": "Essential", "details": "If someone were to reuse a password and one site they had an account with suffered a leak, then a criminal could easily gain unauthorized access to their other accounts. This is usually done through large-scale automated login requests, and it is called Credential Stuffing. Unfortunately, this is all too common, but it's simple to protect against — use a different password for each of your online accounts." },
          { "id": "auth-2", "security": "Use a Secure Password Manager", "priority": "Essential", "details": "For most people, it is going to be near-impossible to remember hundreds of strong and unique passwords. A password manager is an application that generates, stores, and auto-fills your login credentials for you. All your passwords will be encrypted against 1 master password (which you must remember, and it should be very strong). Most password managers have browser extensions and mobile apps, so whatever device you are on, your passwords can be auto-filled. A good all-rounder is [Bitwarden](https://awesome-privacy.xyz/essentials/password-managers/bitwarden), or see [Recommended Password Managers](https://awesome-privacy.xyz/essentials/password-managers)." },
          { "id": "auth-3", "security": "Avoid Sharing Passwords", "priority": "Essential", "details": "While there may be times that you need to share access to an account with another person, you should generally avoid doing this because it makes it easier for the account to become compromised. If you absolutely do need to share a password — for example, when working on a team with a shared account — this should be done via features built into a password manager." },
          { "id": "auth-4", "security": "Enable 2-Factor Authentication", "priority": "Essential", "details": "2FA is where you must provide both something you know (a password) and something you have (such as a code on your phone) to log in. This means that if anyone has your password (e.g., through phishing, malware, or a data breach), they will not be able to log into your account. It's easy to get started, download [an authenticator app](https://github.com/Lissy93/awesome-privacy#2-factor-authentication) onto your phone, and then go to your account security settings and follow the steps to enable 2FA. Next time you log in on a new device, you will be prompted for the code that is displayed in the app on your phone (it works without internet, and the code usually changes every 30 seconds)." },
          { "id": "auth-5", "security": "Keep Backup Codes Safe", "priority": "Essential", "details": "When you enable multi-factor authentication, you will usually be given several codes that you can use if your 2FA method is lost, broken, or unavailable. Keep these codes somewhere safe to prevent loss or unauthorized access. You should store these on paper or in a safe place on disk (e.g., in offline storage or an encrypted file/drive). Don't store these in your password manager as 2FA sources and passwords should be kept separately." },
          { "id": "auth-6", "security": "Sign Up for Breach Alerts", "priority": "Optional", "details": "After a website suffers a significant data breach, the leaked data often ends up on the internet. Several websites collect these leaked records and allow you to search your email address to check if you are in any of their lists. [Firefox Monitor](https://monitor.firefox.com), [Have I Been Pwned](https://haveibeenpwned.com), and [DeHashed](https://dehashed.com) allow you to sign up for monitoring, where they will notify you if your email address appears in any new data sets. It is useful to know as soon as possible when this happens so that you can change your passwords for the affected accounts. [Have i been pwned](https://awesome-privacy.xyz/security-tools/online-tools/have-i-been-pwned) also has domain-wide notification, where you can receive alerts if any email addresses under your entire domain appear (useful if you use aliases for [anonymous forwarding](https://github.com/Lissy93/awesome-privacy#anonymous-mail-forwarding))." },
          { "id": "auth-7", "security": "Shield your Password/PIN", "priority": "Optional", "details": "When typing your password in public places, ensure you are not in direct line of sight of a CCTV camera and that no one can see over your shoulder. Cover your password or pin code while you type, and do not reveal any plain text passwords on your screen." },
          { "id": "auth-8", "security": "Update Critical Passwords Periodically", "priority": "Optional", "details": "Database leaks and breaches are common, and, likely, several of your passwords are already somewhere online. Occasionally updating passwords of security-critical accounts can help mitigate this. But providing that all your passwords are long, strong, and unique, there is no need to do this too often — annually should be sufficient. Enforcing mandatory password changes within organisations is [no longer recommended](https://duo.com/decipher/microsoft-will-no-longer-recommend-forcing-periodic-password-changes), as it encourages colleagues to select weaker passwords." },
          { "id": "auth-9", "security": "Don’t Save your Password in Browsers", "priority": "Optional", "details": "Most modern browsers offer to save your credentials when you log into a site. Don’t allow this, as they are not always encrypted and could allow someone to gain access to your accounts. Instead, use a dedicated password manager to store (and auto-fill) your passwords." },
          { "id": "auth-10", "security": "Avoid Logging In on Someone Else’s Device", "priority": "Optional", "details": "Avoid logging in on other people's computers since you can't be sure their system is clean. Be especially cautious of public machines, as malware and tracking arr more common here. Using someone else's device is especially dangerous with critical accounts like online banking. When using someone else's machine, ensure that you're in a private/incognito session (Use Ctrl+Shift+N/ Cmd+Shift+N). This will request the browser to not save your credentials, cookies, and browsing history." },
          { "id": "auth-11", "security": "Avoid Password Hints", "priority": "Optional", "details": "Some sites allow you to set password hints. Often, it is very easy to guess answers. In cases where password hints are mandatory, use random answers and record them in your password manager (`Name of the first school: 6D-02-8B-!a-E8-8F-81`)." },
          { "id": "auth-12", "security": "Never Answer Online Security Questions Truthfully", "priority": "Optional", "details": "If a site asks security questions (such as place of birth, mother's maiden name, or first car, etc.), don't provide real answers. It is a trivial task for hackers to find out this information online or through social engineering. Instead, create a fictitious answer, and store it inside your password manager. Using real words is better than random characters, as [explained here](https://news.ycombinator.com/item?id=29244870)." },
          { "id": "auth-13", "security": "Don’t Use a 4-digit PIN", "priority": "Optional", "details": "Don’t use a short PIN to access your smartphone or computer. Instead, use a text password or a much longer PIN. Numeric passphrases are easy to crack (A 4-digit pin has 10,000 combinations, compared to 7.4 million for a 4-character alpha-numeric code)." },
          { "id": "auth-14", "security": "Avoid Using SMS for 2FA", "priority": "Optional", "details": "When enabling multi-factor authentication, opt for app-based codes or a hardware token if supported. SMS is susceptible to several common threats, such as [SIM-swapping](https://www.maketecheasier.com/sim-card-hijacking) and [interception](https://secure-voice.com/ss7_attacks). There's also no guarantee of how securely your phone number will be stored or what else it will be used for. From a practical point of view, SMS will only work when you have a signal and can be slow. If a website or service requires the usage of an SMS number for recovery, consider purchasing a second pre-paid phone number only used for account recovery for these instances." },
          { "id": "auth-15", "security": "Avoid Using your PM to Generate OTPs", "priority": "Advanced", "details": "Many password managers are also able to generate 2FA codes. It is best not to use your primary password manager as your 2FA authenticator as well, since it would become a single point of failure if compromised. Instead, use a dedicated [authenticator app](https://github.com/Lissy93/awesome-privacy#2-factor-authentication) on your phone or laptop." },
          { "id": "auth-16", "security": "Avoid Face Unlock", "priority": "Advanced", "details": "Most phones and laptops offer a facial recognition authentication feature, using the camera to compare a snapshot of your face with a stored hash. It may be very convenient, but there are numerous ways to [fool it](https://www.forbes.com/sites/jvchamary/2017/09/18/security-apple-face-id-iphone-x/) and gain access to the device through digital photos and reconstructions from CCTV footage. Unlike your password, there are likely photos of your face on the internet and videos recorded by surveillance cameras." },
          { "id": "auth-17", "security": "Watch Out for Keyloggers", "priority": "Advanced", "details": "A hardware [keylogger](https://en.wikipedia.org/wiki/Hardware_keylogger) is a physical device planted between your keyboard and the USB port, which intercepts all keystrokes and sometimes relays data to a remote server. It gives a hacker access to everything typed, including passwords. The best way to stay protected is just by checking your USB connection after your PC has been unattended. It is also possible for keyloggers to be planted inside the keyboard housing, so look for any signs that the case has been tampered with, and consider bringing your own keyboard to work. Data typed on a virtual keyboard, pasted from the clipboard, or auto-filled by a password manager can not be intercepted by a hardware keylogger." },
          { "id": "auth-18", "security": "Consider a Hardware Token", "priority": "Advanced", "details": "A U2F/FIDO2 security key is a USB (or NFC) device that you insert while logging in to an online service to verify your identity instead of entering a OTP from your authenticator. [SoloKey](https://solokeys.com) and [NitroKey](https://www.nitrokey.com) are examples of such keys. They bring with them several security benefits. Since the browser communicates directly with the device, it cannot be fooled as to which host is requesting authentication because the TLS certificate is checked. [This post](https://security.stackexchange.com/a/71704) is a good explanation of the security of using FIDO U2F tokens. Of course, it is important to store the physical key somewhere safe or keep it on your person. Some online accounts allow for several methods of 2FA to be enabled." },
          { "id": "auth-19", "security": "Consider Offline Password Manager", "priority": "Advanced", "details": "For increased security, an encrypted offline password manager will give you full control over your data. [KeePass](https://awesome-privacy.xyz/essentials/password-managers/keepass) is a popular choice, with lots of [plugins](https://keepass.info/plugins.html) and community forks with additional compatibility and functionality. Popular clients include: [KeePassXC](https://keepassxc.org) (desktop), [KeePassDX](https://www.keepassdx.com) (Android) and [StrongBox](https://apps.apple.com/us/app/strongbox-password-safe/id897283731) (iOS). The drawback being that it may be slightly less convenient for some, and it will be up to you to back it up and store it securely." },
          { "id": "auth-20", "security": "Consider Unique Usernames", "priority": "Advanced", "details": "Having different passwords for each account is a good first step, but if you also use a unique username, email, or phone number to log in, then it will be significantly harder for anyone trying to gain unauthorised access. The easiest method for multiple emails, is using auto-generated aliases for anonymous mail forwarding. This is where [anything]@yourdomain.com will arrive in your inbox, allowing you to use a different email for each account (see [Mail Alias Providers](https://github.com/Lissy93/awesome-privacy#mail-forwarding)). Usernames are easier since you can use your password manager to generate, store, and auto-fill these. Virtual phone numbers can be generated through your VOIP provider." }
        ]
      },
      {
        "id": "threat-and-vulnerability-management",
        "title": "Threat and Vulnerability Management",
        "description": "Identifying and mitigating threats.",
        "longDescription": "Proactively identifying, assessing, and mitigating vulnerabilities in authentication systems is essential to defend against evolving threats.",
        "items": []
      },
      {
        "id": "continuity",
        "title": "Continuity",
        "description": "Ensuring authentication services are resilient.",
        "longDescription": "Planning for disruptions to authentication services ensures that users can maintain access to critical systems during an incident.",
        "items": []
      },
      {
        "id": "supplier-relationships-security",
        "title": "Supplier Relationships Security",
        "description": "Managing third-party authentication risks.",
        "longDescription": "When relying on third-party providers for authentication services, it is crucial to manage the associated security risks through due diligence and contractual agreements.",
        "items": []
      },
      {
        "id": "legal-and-compliance",
        "title": "Legal and Compliance",
        "description": "Adhering to authentication regulations.",
        "longDescription": "Ensuring that authentication practices comply with relevant legal, statutory, and regulatory requirements is a critical aspect of information security.",
        "items": []
      },
      {
        "id": "information-security-event-management",
        "title": "Information Security Event Management",
        "description": "Responding to authentication incidents.",
        "longDescription": "Having a formal process for managing authentication-related security incidents is key to minimizing their impact and learning from them to prevent recurrence.",
        "items": []
      },
      {
        "id": "information-security-assurance",
        "title": "Information Security Assurance",
        "description": "Verifying authentication effectiveness.",
        "longDescription": "Regularly assessing and auditing authentication controls provides assurance that they are implemented correctly and operating effectively.",
        "items": []
      },
      {
        "id": "cryptography",
        "title": "Cryptography",
        "description": "Using encryption to protect credentials.",
        "longDescription": "Cryptography is the cornerstone of secure authentication, used to protect passwords in transit and at rest, and to ensure the integrity of authentication messages.",
        "items": []
      }
    ]
  },
  {
    "id": "iso-27001-compliance",
    "title": "ISO 27001 Compliance",
    "description": "Checklist for implementing ISO/IEC 27001:2022.",
    "longDescription": "A comprehensive checklist to guide organizations through the process of implementing and maintaining an Information Security Management System (ISMS) in accordance with the ISO/IEC 27001:2022 standard.",
    "iconName": "ShieldIcon",
    "color": "#3B82F6",
    "items": [
      { "id": "iso-4.1-audit-1", "security": "Has the organization identified all internal and external issues that may affect its ISMS?", "priority": "Essential", "details": "This foundational step ensures the ISMS is not built in a vacuum. Auditors look for documented analysis (like PESTLE or SWOT) demonstrating that the organization understands its unique landscape of legal, technical, market, and cultural factors that can impact information security." },
      { "id": "iso-4.1-audit-2", "security": "Is there a documented procedure or methodology for determining the organization’s context?", "priority": "Essential", "details": "Auditors verify that a systematic, repeatable process is in place for context analysis, rather than an ad-hoc effort. This ensures consistency and thoroughness in identifying factors relevant to the ISMS." },
      { "id": "iso-4.1-audit-3", "security": "Has top management reviewed and approved the context analysis?", "priority": "Essential", "details": "This demonstrates leadership commitment and ensures that the ISMS is aligned with the strategic direction of the business. Approval should be formally documented, for instance, in management review meeting minutes." },
      { "id": "iso-4.1-audit-4", "security": "Are external factors such as legal, political, technological, economic, and social influences documented?", "priority": "Essential", "details": "Evidence of a PESTLE (or similar) analysis shows the organization has considered the broader environment it operates in. This is crucial for identifying compliance obligations and external threats." },
      { "id": "iso-4.1-audit-5", "security": "Are internal factors such as organizational culture, structure, roles, resources, and technologies documented?", "priority": "Essential", "details": "Auditors look for an inward assessment that covers governance, capabilities, and culture. Understanding these internal dynamics is key to designing an ISMS that is practical and effective for the specific organization." },
      { "id": "iso-4.1-audit-6", "security": "Are all relevant stakeholders (internal & external) involved in identifying contextual issues?", "priority": "Essential", "details": "The process should not be confined to the IT or security team. Involving departments like HR, Legal, and Operations ensures a holistic view of security requirements and contextual factors." },
      { "id": "iso-4.1-audit-7", "security": "Has the organization considered information security threats and opportunities within the context?", "priority": "Essential", "details": "The context analysis must directly inform risk management. This question checks if the identified issues are translated into specific security risks to be mitigated and opportunities to be pursued." },
      { "id": "iso-4.1-audit-8", "security": "Are dependencies on suppliers, vendors, partners, or cloud services captured as part of the external context?", "priority": "Essential", "details": "This is critical for managing supply chain risk. Auditors expect to see a clear understanding of how third-party relationships impact the organization's security posture." },
      { "id": "iso-4.1-audit-9", "security": "Are customer expectations, industry standards, and regulatory requirements reflected in the context statement?", "priority": "Essential", "details": "The ISMS must meet the needs of interested parties. This verifies that compliance obligations and customer commitments are a core driver of the security strategy." },
      { "id": "iso-4.1-audit-10", "security": "Has the organization considered market and competition-related risks in its context analysis?", "priority": "Essential", "details": "Understanding competitive pressures and market dynamics can reveal specific security threats, such as industrial espionage or reputational damage, that the ISMS needs to address." },
      { "id": "iso-4.1-audit-11", "security": "Are environmental factors (e.g., physical location, disaster exposure) analyzed?", "priority": "Essential", "details": "This question links context to business continuity and physical security. The organization must consider threats from its physical environment, such as natural disasters or political instability." },
      { "id": "iso-4.1-audit-12", "security": "Is the context reviewed during management review meetings?", "priority": "Essential", "details": "The context is not a one-time exercise. Auditors check for evidence that it is a standing agenda item in management reviews, ensuring its ongoing relevance and adequacy." },
      { "id": "iso-4.1-audit-13", "security": "Are significant changes (e.g., acquisitions, restructuring, new systems) triggers for context review?", "priority": "Essential", "details": "This assesses the organization's ability to adapt. The process for determining context should include triggers for re-evaluation when significant internal or external changes occur." },
      { "id": "iso-4.1-audit-14", "security": "Has the organization mapped its business objectives to ISMS objectives within the context?", "priority": "Essential", "details": "This is a key test of alignment. The ISMS should exist to support business goals, and this connection must be explicit and logical based on the defined context." },
      { "id": "iso-4.1-audit-15", "security": "Is there a link between context analysis and risk assessment outcomes?", "priority": "Essential", "details": "Auditors will trace the 'golden thread' from context to risk. The issues identified in the context analysis should be visible as inputs into the risk assessment process." },
      { "id": "iso-4.1-audit-16", "security": "Are documented SWOT or PESTLE analyses available?", "priority": "Essential", "details": "Auditors look for tangible evidence. Formal analysis documents like SWOT or PESTLE provide clear proof that a structured methodology was used to determine the organizational context." },
      { "id": "iso-4.1-audit-17", "security": "Are internal strengths and weaknesses documented and communicated?", "priority": "Essential", "details": "This checks for self-awareness. An honest assessment of internal capabilities and limitations is crucial for realistic risk management and resource allocation." },
      { "id": "iso-4.1-audit-18", "security": "Are external opportunities and threats identified and analyzed?", "priority": "Essential", "details": "The ISMS should be proactive, not just reactive. Identifying opportunities (e.g., using strong security as a market differentiator) and threats (e.g., new hacking techniques) is a sign of a mature system." },
      { "id": "iso-4.1-audit-19", "security": "Has the organization established criteria for monitoring changes in context?", "priority": "Essential", "details": "This verifies that the review process is planned. There should be defined intervals (e.g., annually) and triggers for reviewing the context to ensure it remains current." },
      { "id": "iso-4.1-audit-20", "security": "Are all identified issues assigned owners for monitoring and updating?", "priority": "Essential", "details": "Accountability is key. Assigning ownership ensures that someone is responsible for tracking each contextual factor and reporting significant changes." },
      { "id": "iso-4.1-audit-21", "security": "Are internal communication channels established to report contextual changes?", "priority": "Essential", "details": "A process must exist for relevant information to flow to the team responsible for the ISMS. This ensures that changes in the business or environment are promptly considered." },
      { "id": "iso-4.1-audit-22", "security": "Are contextual issues integrated into ISMS risk registers or strategic documents?", "priority": "Essential", "details": "This question assesses whether the context analysis is an active, integrated part of governance or just a standalone document. Integration shows it has a real impact on decision-making." },
      { "id": "iso-4.1-audit-23", "security": "Has the organization defined how context influences its information security policy?", "priority": "Essential", "details": "The high-level information security policy should reflect the organization's context. For example, if the context identifies heavy regulation, the policy should emphasize compliance." },
      { "id": "iso-4.1-audit-24", "security": "Is there documented evidence (meeting minutes, reports, risk analysis) supporting context identification?", "priority": "Essential", "details": "Auditors need objective evidence. This includes reports from workshops, management review minutes approving the context, and risk assessments that refer back to it." },
      { "id": "iso-4.1-audit-25", "security": "Are third-party dependencies (cloud, outsourced services) identified as part of external context?", "priority": "Essential", "details": "This highlights supply chain risk management. The organization must demonstrate a clear understanding of how its reliance on external providers affects its information security." },
      { "id": "iso-4.1-audit-26", "security": "Has management analyzed how technological trends (AI, IoT, automation) affect ISMS scope?", "priority": "Essential", "details": "This tests for a forward-looking approach. A mature ISMS considers emerging technologies and their potential impact on security risks and controls." },
      { "id": "iso-4.1-audit-27", "security": "Has the organization identified legal jurisdictions applicable to its operations?", "priority": "Essential", "details": "Compliance is non-negotiable. Auditors verify that the organization has identified all relevant legal and regulatory frameworks (like GDPR, HIPAA, etc.) based on where it operates and handles data." },
      { "id": "iso-4.1-audit-28", "security": "Are contractual, regulatory, and compliance obligations linked to context definition?", "priority": "Essential", "details": "This confirms that legal and contractual requirements are treated as key inputs to the ISMS. The context should explicitly list these obligations." },
      { "id": "iso-4.1-audit-29", "security": "Are cultural factors (e.g., staff behavior, awareness, management style) part of internal context?", "priority": "Essential", "details": "People are a critical part of security. Recognizing the internal culture helps in designing realistic and effective controls, especially around awareness and training." },
      { "id": "iso-4.1-audit-30", "security": "Is there a process for verifying that identified context issues are still relevant over time?", "priority": "Essential", "details": "This checks for a process of continual improvement. The organization must show how it periodically validates its assumptions about its internal and external environment." },
      { "id": "iso-4.1-audit-31", "security": "Are information security dependencies between departments captured (e.g., IT–HR–Finance)?", "priority": "Essential", "details": "Security is a cross-functional responsibility. The context should recognize how different parts of the organization interact and depend on each other for security." },
      { "id": "iso-4.1-audit-32", "security": "Does top management demonstrate awareness of internal/external issues during interviews or reviews?", "priority": "Essential", "details": "Beyond documents, auditors will assess if leadership truly understands the context. Their ability to speak knowledgeably about these issues is a strong indicator of engagement." },
      { "id": "iso-4.1-audit-33", "security": "Are context updates recorded when significant organizational changes occur (e.g., mergers)?", "priority": "Essential", "details": "This verifies that the context is a living document. There should be evidence of updates in response to major events that reshape the business or its environment." },
      { "id": "iso-4.1-audit-34", "security": "Are business continuity and ISMS scope aligned with contextual understanding?", "priority": "Essential", "details": "The context analysis helps define what is critical to the business. This understanding should directly influence the scope of both the ISMS and business continuity planning." },
      { "id": "iso-4.1-audit-35", "security": "Is there a defined owner or team responsible for maintaining the context documentation?", "priority": "Essential", "details": "Clear accountability is crucial for maintenance. An auditor will want to see that a specific role or group is tasked with keeping the context analysis up-to-date." },
      { "id": "iso-4.1-audit-36", "security": "Are risks arising from contextual factors analyzed in risk treatment plans?", "priority": "Essential", "details": "This checks for the practical application of context analysis. Specific risks identified from the context (e.g., a new regulation) should have corresponding treatment actions." },
      { "id": "iso-4.1-audit-37", "security": "Are relevant contextual factors linked to KPIs or monitoring metrics?", "priority": "Essential", "details": "This demonstrates a data-driven approach. Linking context to performance indicators shows the organization is actively monitoring the factors it has identified as important." },
      { "id": "iso-4.1-audit-38", "security": "Is there evidence of management communication regarding the organization’s context to staff?", "priority": "Essential", "details": "A shared understanding is vital for a strong security culture. Auditors may look for evidence that the strategic context has been communicated to relevant employees." },
      { "id": "iso-4.1-audit-39", "security": "Are external parties (e.g., regulators, clients) aware of how context affects ISMS operations?", "priority": "Essential", "details": "In some cases, it's important to communicate context externally. This can provide assurance to clients and regulators that the ISMS is well-aligned and robust." },
      { "id": "iso-4.1-audit-40", "security": "Is there evidence that the organization’s mission and vision statements align with ISMS context?", "priority": "Essential", "details": "This is a high-level check for strategic alignment. The goals of the ISMS, as defined by its context, should not conflict with the overall mission and vision of the organization." },
      { "id": "iso-4.1-audit-41", "security": "Has the ISMS implementation team validated that context supports the ISMS scope statement?", "priority": "Essential", "details": "The context justifies the scope. There should be a clear and logical line from the identified internal/external issues to the boundaries defined in the ISMS scope." },
      { "id": "iso-4.2", "security": "4.2 - Understanding the needs and expectations of interested parties", "priority": "Essential", "details": "Analyze the needs and expectations of interested parties to incorporate them into the ISMS and address relevant information security requirements." },
      { "id": "iso-4.3", "security": "4.3 - Determining the scope of the information security management system", "priority": "Essential", "details": "Define the scope of the ISMS by considering internal and external factors, stakeholder needs, and dependencies within the operational environment." },
      { "id": "iso-4.4", "security": "4.4 - Information security management system", "priority": "Essential", "details": "Build, run, and continually improve an ISMS to effectively manage information security risks and meet organizational goals." },
      { "id": "iso-5.1", "security": "5.1 - Leadership and commitment", "priority": "Essential", "details": "Demonstrate leadership and commitment by supporting the ISMS, aligning it with organizational objectives, allocating resources, promoting a security culture, and driving continual improvement." },
      { "id": "iso-5.2", "security": "5.2 - Policy", "priority": "Essential", "details": "Establish an information security policy aligned with the organization's objectives and strategic direction, outlining commitments to compliance, continual improvement, and the promotion of information security." },
      { "id": "iso-5.3", "security": "5.3 - Organizational roles, responsibilities and authorities", "priority": "Essential", "details": "Define, assign, and communicate roles, responsibilities, and authorities to ensure the effective implementation and operation of the ISMS, with accountability aligned to organizational objectives." },
      { "id": "iso-6.1.1", "security": "6.1.1 - General (Actions to address risks and opportunities)", "priority": "Essential", "details": "Establish a process to identify information security risks and opportunities, considering internal and external factors, stakeholder needs, and applicable requirements to ensure the ISMS achieves its objectives." },
      { "id": "iso-6.1.2", "security": "6.1.2 - Information security risk assessment requirement", "priority": "Essential", "details": "Establish a process to assess information security risks at planned intervals, using defined criteria to evaluate threats to confidentiality, integrity, and availability, ensuring consistent and reliable results." },
      { "id": "iso-6.1.3", "security": "6.1.3 - Information security risk treatment", "priority": "Essential", "details": "Define a process to address identified information security risks by selecting appropriate controls, ensuring alignment with risk acceptance criteria, and documenting them in a risk treatment plan." },
      { "id": "iso-6.2", "security": "6.2 - Information security objectives and planning to achieve them", "priority": "Essential", "details": "Set measurable information security objectives aligned with the ISMS and strategic goals, and plan actions detailing responsibilities, resources, timelines, and evaluation methods to achieve them." },
      { "id": "iso-6.3", "security": "6.3 - Planning for changes", "priority": "Essential", "details": "Plan changes to the ISMS systematically to ensure alignment with information security requirements, seamless integration into existing processes, and effective risk management." },
      { "id": "iso-7.1", "security": "7.1 - Resources", "priority": "Essential", "details": "Provide the necessary resources to build, run, and continually improve the ISMS, ensuring its effective operation and alignment with organizational goals." },
      { "id": "iso-7.2", "security": "7.2 - Competence", "priority": "Essential", "details": "Ensure personnel involved in the ISMS possess the necessary competence through appropriate education, training, or experience to fulfill their responsibilities effectively." },
      { "id": "iso-7.3", "security": "7.3 - Awareness", "priority": "Essential", "details": "Promote awareness among relevant personnel about the ISMS, their role in information security, and the importance of compliance with security policies and requirements." },
      { "id": "iso-7.4", "security": "7.4 - Communication", "priority": "Essential", "details": "Establish effective internal and external communication processes, ensuring the timely and appropriate exchange of information relevant to the ISMS and its objectives." },
      { "id": "iso-7.5.1", "security": "7.5.1 - General (Documented Information)", "priority": "Essential", "details": "Document the ISMS as needed to ensure effective planning, operation, control of processes, and alignment with organizational requirements." },
      { "id": "iso-7.5.2", "security": "7.5.2 - Creating and Updating documented information", "priority": "Essential", "details": "Ensure ISMS documentation is appropriately created, updated, and controlled, including proper approval and version management." },
      { "id": "iso-7.5.3", "security": "7.5.3 - Control of documented information", "priority": "Essential", "details": "Make ISMS documentation accessible and usable for those who need it, while protecting it from unauthorized access or loss." },
      { "id": "iso-8.1", "security": "8.1 - Operational planning and control", "priority": "Essential", "details": "Plan and control ISMS processes, ensuring consistency with requirements and making necessary adjustments to address risks and opportunities." },
      { "id": "iso-8.2", "security": "8.2 - Information security risk assessment", "priority": "Essential", "details": "Implement the risk assessment process to identify, evaluate, and prioritize information security risks as defined in the ISMS framework." },
      { "id": "iso-8.3", "security": "8.3 - Information security risk treatment", "priority": "Essential", "details": "Apply the risk treatment process by selecting and implementing appropriate controls to address identified risks, ensuring alignment with the organization’s risk acceptance criteria." },
      { "id": "iso-9.1", "security": "9.1 - Monitoring, measurement, analysis, evaluation", "priority": "Essential", "details": "Monitor, measure, analyze, and evaluate the ISMS’s performance and effectiveness using appropriate methods aligned with the organization’s objectives." },
      { "id": "iso-9.2.1", "security": "9.2.1 - General (Internal audit)", "priority": "Essential", "details": "Conduct internal audits at planned intervals to ensure the ISMS complies with ISO/IEC 27001 requirements and is effectively implemented and maintained." },
      { "id": "iso-9.2.2", "security": "9.2.2 - Internal audit programme", "priority": "Essential", "details": "Plan and perform internal audits, including defining criteria, scope, methods, and responsibilities, and report the results to relevant management." },
      { "id": "iso-9.3.1", "security": "9.3.1 - General (Management review)", "priority": "Essential", "details": "Review the ISMS periodically to ensure its suitability, adequacy, and effectiveness in achieving organizational objectives." },
      { "id": "iso-9.3.2", "security": "9.3.2 - Management review inputs", "priority": "Essential", "details": "Include inputs such as audit results, ISMS performance, risk status, improvement opportunities, and required changes in the management review." },
      { "id": "iso-9.3.3", "security": "9.3.3 - Management review results", "priority": "Essential", "details": "Document the results of the management reviews, including decisions on improvements, ISMS changes, and resource requirements." },
      { "id": "iso-10.1", "security": "10.1 - Continual improvement", "priority": "Essential", "details": "Identify and act on opportunities for continual improvement to enhance the ISMS's effectiveness and alignment with organizational goals." },
      { "id": "iso-10.2", "security": "10.2 - Nonconformity and corrective action", "priority": "Essential", "details": "Address nonconformities by taking corrective actions, identifying root causes, and implementing measures to prevent recurrence while documenting the process." },
      { "id": "iso-a.5.1", "security": "A.5.1 - Policies for information security", "priority": "Essential", "details": "This control establishes and maintains information security policies aligned with organizational objectives. Measures include defining scope, setting goals, and ensuring alignment with compliance requirements." },
      { "id": "iso-a.5.2", "security": "A.5.2 - Information security roles and responsibilities", "priority": "Essential", "details": "This control defines and assigns roles and responsibilities for information security to ensure accountability. Measures include clear documentation of responsibilities, periodic reviews, and enforcement mechanisms." },
      { "id": "iso-a.5.3", "security": "A.5.3 - Segregation of duties", "priority": "Essential", "details": "This control ensures segregation of duties to reduce the risk of errors, fraud, and unauthorized access. Measures include role separation, access restrictions, and regular audits." },
      { "id": "iso-a.5.4", "security": "A.5.4 - Management responsibilities", "priority": "Essential", "details": "This control ensures management responsibilities for information security are clearly defined and implemented. Measures include setting objectives, allocating resources, and overseeing compliance." },
      { "id": "iso-a.5.5", "security": "A.5.5 - Contact with authorities", "priority": "Essential", "details": "This control ensures timely communication with relevant authorities during information security incidents. Measures include establishing contact protocols, maintaining updated contact lists, and assigning responsibilities." },
      { "id": "iso-a.5.6", "security": "A.5.6 - Contact with special interest groups", "priority": "Essential", "details": "This control facilitates contact with special interest groups to stay informed about security trends and practices. Measures include participation in forums, memberships, and collaborative initiatives." },
      { "id": "iso-a.5.7", "security": "A.5.7 - Threat intelligence", "priority": "Essential", "details": "This control ensures threat intelligence is developed and maintained to identify and mitigate security risks. Measures include monitoring threat feeds, analyzing trends, and sharing actionable insights." },
      { "id": "iso-a.5.8", "security": "A.5.8 - Information security in project management", "priority": "Essential", "details": "This control incorporates information security into project management practices. Measures include risk assessments, compliance reviews, and security checkpoints during project lifecycles." },
      { "id": "iso-a.5.9", "security": "A.5.9 - Inventory of information and other associated assets", "priority": "Essential", "details": "This control ensures an accurate inventory of information and associated assets is maintained. Measures include asset tracking, periodic audits, and classification by sensitivity." },
      { "id": "iso-a.5.10", "security": "A.5.10 - Acceptable use of information and other associated assets", "priority": "Essential", "details": "This control defines acceptable use of information and associated assets to ensure proper handling. Measures include documented policies, user training, and enforcement mechanisms." },
      { "id": "iso-a.5.11", "security": "A.5.11 - Return of assets", "priority": "Essential", "details": "This control ensures the secure return of assets when employees or contractors leave or change roles. Measures include checklists, asset tracking, and decommissioning protocols." },
      { "id": "iso-a.5.12", "security": "A.5.12 - Classification of information", "priority": "Essential", "details": "This control ensures information is classified based on its sensitivity and value to ensure appropriate protection. Measures include classification schemes, access restrictions, and labeling guidelines." },
      { "id": "iso-a.5.13", "security": "A.5.13 - Labelling of information", "priority": "Essential", "details": "This control ensures consistent labeling of information to reflect its classification and handling requirements. Measures include standardized templates, training, and audits." },
      { "id": "iso-a.5.14", "security": "A.5.14 - Information transfer", "priority": "Essential", "details": "This control establishes secure processes for transferring information between systems or organizations. Measures include encryption, access controls, and secure transfer protocols." },
      { "id": "iso-a.5.15", "security": "A.5.15 - Access control", "priority": "Essential", "details": "This control implements and maintains access control mechanisms to restrict access to authorized individuals. Measures include role-based access, multi-factor authentication, and periodic reviews." },
      { "id": "iso-a.5.16", "security": "A.5.16 - Identity management", "priority": "Essential", "details": "This control ensures identities are managed securely to guarantee accurate and reliable access to systems. Measures include identity verification, lifecycle management, and access provisioning." },
      { "id": "iso-a.5.17", "security": "A.5.17 - Authentication information", "priority": "Essential", "details": "This control protects authentication information, such as passwords, to prevent unauthorized access. Measures include encryption, secure storage, and periodic password updates." },
      { "id": "iso-a.5.18", "security": "A.5.18 - Access rights", "priority": "Essential", "details": "This control ensures access rights are regularly reviewed and managed to align with roles and responsibilities. Measures include periodic audits, access revocation, and automated access management." },
      { "id": "iso-a.5.19", "security": "A.5.19 - Information security in supplier relationships", "priority": "Essential", "details": "This control ensures information security is embedded in supplier relationships and processes. Measures include due diligence, security reviews, and ongoing monitoring." },
      { "id": "iso-a.5.20", "security": "A.5.20 - Addressing information security within supplier agreements", "priority": "Essential", "details": "This control addresses information security requirements within supplier agreements. Measures include explicit contract clauses, compliance audits, and defined penalties for violations." },
      { "id": "iso-a.5.21", "security": "A.5.21 - Managing information security in the ICT supply chain", "priority": "Essential", "details": "This control manages information security risks in the ICT supply chain to ensure security of services and components. Measures include risk assessments, supplier evaluations, and incident response protocols." },
      { "id": "iso-a.5.22", "security": "A.5.22 - Monitor, review and change management of supplier services", "priority": "Essential", "details": "This control ensures supplier services are monitored, reviewed, and adjusted to maintain information security. Measures include service level agreements, periodic reviews, and contract updates." },
      { "id": "iso-a.5.23", "security": "A.5.23 - Information security for use of cloud services", "priority": "Essential", "details": "This control ensures the secure use of cloud services by addressing associated risks. Measures include data encryption, access controls, and provider compliance reviews." },
      { "id": "iso-a.5.24", "security": "A.5.24 - Information security incident management planning and preparation", "priority": "Essential", "details": "This control ensures proper planning and preparation for managing information security incidents. Measures include incident response plans, training exercises, and communication protocols." },
      { "id": "iso-a.5.25", "security": "A.5.25 - Assessment and decision on information security events", "priority": "Essential", "details": "This control establishes processes for assessing and deciding on actions related to information security events. Measures include root cause analysis, risk evaluation, and mitigation plans." },
      { "id": "iso-a.5.26", "security": "A.5.26 - Response to information security incidents", "priority": "Essential", "details": "This control ensures effective response to information security incidents to minimize impact and recover quickly. Measures include incident reporting, escalation protocols, and containment strategies." },
      { "id": "iso-a.5.27", "security": "A.5.27 - Learning from information security incidents", "priority": "Essential", "details": "This control ensures lessons learned from information security incidents are documented and implemented to improve processes. Measures include post-incident reviews, action plans, and policy updates." },
      { "id": "iso-a.5.28", "security": "A.5.28 - Collection of evidence", "priority": "Essential", "details": "This control ensures evidence is collected and preserved during security incidents to support investigations. Measures include chain-of-custody procedures, secure storage, and access controls." },
      { "id": "iso-a.5.29", "security": "A.5.29 - Information security during disruption", "priority": "Essential", "details": "This control ensures information security is maintained during disruptions to guarantee continuity of operations. Measures include contingency plans, backup systems, and failover mechanisms." },
      { "id": "iso-a.5.30", "security": "A.5.30 - ICT readiness for business continuity", "priority": "Essential", "details": "This control ensures ICT readiness for business continuity to minimize downtime during disruptions. Measures include testing recovery plans, redundant systems, and disaster recovery sites." },
      { "id": "iso-a.5.31", "security": "A.5.31 - Legal, statutory, regulatory and contractual requirements", "priority": "Essential", "details": "This control ensures compliance with legal, statutory, regulatory, and contractual information security requirements. Measures include policy reviews, audits, and evidence documentation." },
      { "id": "iso-a.5.32", "security": "A.5.32 - Intellectual property rights", "priority": "Essential", "details": "This control ensures intellectual property rights are protected through appropriate information security measures. Measures include access restrictions, encryption, and legal agreements." },
      { "id": "iso-a.5.33", "security": "A.5.33 - Protection of records", "priority": "Essential", "details": "This control ensures records are securely stored and protected to prevent loss or unauthorized access. Measures include retention policies, secure storage, and access controls." },
      { "id": "iso-a.5.34", "security": "A.5.34 - Privacy and protection of PII", "priority": "Essential", "details": "This control protects privacy and ensures the secure handling of personally identifiable information (PII). Measures include anonymization, encryption, and compliance with privacy laws." },
      { "id": "iso-a.5.35", "security": "A.5.35 - Independent review of information security", "priority": "Essential", "details": "This control ensures independent reviews of information security to evaluate effectiveness and compliance. Measures include external audits, risk assessments, and follow-up actions." },
      { "id": "iso-a.5.36", "security": "A.5.36 - Compliance with policies, rules and standards for information security", "priority": "Essential", "details": "This control ensures compliance with all policies, rules, and standards for information security. Measures include regular training, policy reviews, and enforcement mechanisms." },
      { "id": "iso-a.5.37", "security": "A.5.37 - Documented operating procedures", "priority": "Essential", "details": "This control develops and maintains documented operating procedures to ensure consistency in security practices. Measures include process documentation, version control, and accessibility." },
      { "id": "iso-a.6.1", "security": "A.6.1 - Screening", "priority": "Essential", "details": "This control ensures the implementation of screening processes to verify the suitability of candidates before employment. Measures include background checks, identity verification, and assessment of qualifications to reduce security risks." },
      { "id": "iso-a.6.2", "security": "A.6.2 - Terms and conditions of employment", "priority": "Essential", "details": "This control ensures that terms and conditions of employment include information security responsibilities. Measures include explicit clauses about confidentiality, compliance with policies, and consequences for breaches." },
      { "id": "iso-a.6.3", "security": "A.6.3 - Information security awareness, education and training", "priority": "Essential", "details": "This control ensures that employees receive regular information security awareness, education, and training. Measures include scheduled training sessions, e-learning programs, and simulated phishing exercises." },
      { "id": "iso-a.6.4", "security": "A.6.4 - Disciplinary process", "priority": "Essential", "details": "This control establishes a disciplinary process to address breaches of information security policies. Measures include clear guidelines, escalation procedures, and consistent enforcement to maintain accountability." },
      { "id": "iso-a.6.5", "security": "A.6.5 - Responsibilities after termination or change of employment", "priority": "Essential", "details": "This control ensures that responsibilities related to information security are defined and enforced after termination or role changes. Measures include revoking access rights, collecting organizational assets, and conducting exit interviews." },
      { "id": "iso-a.6.6", "security": "A.6.6 - Confidentiality or non-disclosure agreements", "priority": "Essential", "details": "This control implements confidentiality or non-disclosure agreements to protect sensitive information. Measures include signed agreements at the start of employment, periodic reminders, and enforcement of legal actions in case of violations." },
      { "id": "iso-a.6.7", "security": "A.6.7 - Remote working", "priority": "Essential", "details": "This control ensures the secure management of information security risks during remote working. Measures include secure access to corporate systems, mandatory use of VPNs, and policies for handling sensitive data remotely." },
      { "id": "iso-a.6.8", "security": "A.6.8 - Information security event reporting", "priority": "Essential", "details": "This control ensures employees can promptly report information security events. Measures include incident reporting channels, awareness campaigns, and follow-up procedures to investigate and address reported events." },
      { "id": "iso-a.7.1", "security": "A.7.1 - Physical security perimeters", "priority": "Essential", "details": "This control establishes physical security perimeters to protect critical areas from unauthorized access. Measures include barriers, access controls, and monitoring systems to ensure only authorized individuals can enter." },
      { "id": "iso-a.7.2", "security": "A.7.2 - Physical entry", "priority": "Essential", "details": "This control ensures physical entry points are controlled and monitored to prevent unauthorized access. Measures include badge systems, security personnel, and visitor logs." },
      { "id": "iso-a.7.3", "security": "A.7.3 - Securing offices, rooms and facilities", "priority": "Essential", "details": "This control ensures that offices, rooms, and facilities are secured to protect information and resources. Measures include locked doors, restricted areas, and surveillance systems." },
      { "id": "iso-a.7.4", "security": "A.7.4 - Physical security monitoring", "priority": "Essential", "details": "This control implements physical security monitoring to detect and respond promptly to threats. Measures include CCTV systems, motion detectors, and real-time alerts." },
      { "id": "iso-a.7.5", "security": "A.7.5 - Protecting against physical and environmental threats", "priority": "Essential", "details": "This control protects systems and resources from physical and environmental threats. Measures include fire suppression systems, temperature controls, and flood prevention barriers." },
      { "id": "iso-a.7.6", "security": "A.7.6 - Working In secure areas", "priority": "Essential", "details": "This control ensures that secure areas are managed to allow authorized access only. Measures include access control systems, visitor escorts, and activity monitoring." },
      { "id": "iso-a.7.7", "security": "A.7.7 - Clear desk and clear screen", "priority": "Essential", "details": "This control ensures sensitive information is not left exposed by adopting clear desk and clear screen policies. Measures include locking sensitive documents away and auto-locking screens when not in use." },
      { "id": "iso-a.7.8", "security": "A.7.8 - Equipment siting and protection", "priority": "Essential", "details": "This control ensures that equipment is positioned and protected to prevent unauthorized access or damage. Measures include secure mounting, locked cabinets, and restricted access areas." },
      { "id": "iso-a.7.9", "security": "A.7.9 - Security of assets off-premises", "priority": "Essential", "details": "This control ensures assets used or stored off-premises are secured to maintain confidentiality and integrity. Measures include encryption, secure transport, and access tracking." },
      { "id": "iso-a.7.10", "security": "A.7.10 - Storage media", "priority": "Essential", "details": "This control safeguards storage media to prevent unauthorized access or tampering. Measures include secure storage, encryption, and access restrictions." },
      { "id": "iso-a.7.11", "security": "A.7.11 - Supporting utilities", "priority": "Essential", "details": "This control ensures that supporting utilities, such as power and cooling systems, are reliable and protected from disruptions. Measures include redundant systems and physical security." },
      { "id": "iso-a.7.12", "security": "A.7.12 - Cabling security", "priority": "Essential", "details": "This control ensures that cables are secured to prevent unauthorized interception or damage. Measures include protective conduits, proper labeling, and secure routing." },
      { "id": "iso-a.7.13", "security": "A.7.13 - Equipment maintenance", "priority": "Essential", "details": "This control ensures that equipment is maintained to guarantee proper functioning and prevent failures. Measures include regular servicing, secure maintenance practices, and authorized personnel access." },
      { "id": "iso-a.7.14", "security": "A.7.14 - Secure disposal or re-use of equipment", "priority": "Essential", "details": "This control ensures the secure disposal or reuse of equipment to protect sensitive information. Measures include data sanitization, physical destruction, and certified disposal processes." },
      { "id": "iso-a.8.1", "security": "A.8.1 - User end point devices", "priority": "Essential", "details": "This control ensures the protection of endpoint devices such as laptops, desktops, and mobile devices by implementing security measures like endpoint detection, encryption, and secure configurations to minimize risks." },
      { "id": "iso-a.8.2", "security": "A.8.2 - Privileged access rights", "priority": "Essential", "details": "This control ensures that privileged access rights are granted, managed, and monitored carefully to prevent misuse and enhance security. Measures include role-based access controls, periodic reviews, and strict account management." },
      { "id": "iso-a.8.3", "security": "A.8.3 - Information access restriction", "priority": "Essential", "details": "This control restricts access to sensitive information based on need-to-know principles. Measures include user authentication, role-based permissions, and regular access reviews." },
      { "id": "iso-a.8.4", "security": "A.8.4 - Access to source code", "priority": "Essential", "details": "This control secures access to source code by preventing unauthorized viewing, modification, or exposure. Measures include version control, secure repositories, and restricted developer access." },
      { "id": "iso-a.8.5", "security": "A.8.5 - Secure authentication", "priority": "Essential", "details": "This control implements strong authentication mechanisms, such as multi-factor authentication, to verify user identities and prevent unauthorized access." },
      { "id": "iso-a.8.6", "security": "A.8.6 - Capacity management", "priority": "Essential", "details": "This control ensures system capacity is managed to provide adequate performance and prevent disruptions. Measures include monitoring resource usage and planning for future needs." },
      { "id": "iso-a.8.7", "security": "A.8.7 - Protection against malware", "priority": "Essential", "details": "This control deploys measures like antivirus software, threat detection tools, and regular updates to protect systems from malware and malicious attacks." },
      { "id": "iso-a.8.8", "security": "A.8.8 - Management of technical vulnerabilities", "priority": "Essential", "details": "This control identifies, evaluates, and remediates technical vulnerabilities promptly to minimize security risks. Measures include vulnerability scanning and patch management." },
      { "id": "iso-a.8.9", "security": "A.8.9 - Configuration management", "priority": "Essential", "details": "This control ensures consistent management of system configurations to maintain security settings and prevent unauthorized changes." },
      { "id": "iso-a.8.10", "security": "A.8.10 - Information deletion", "priority": "Essential", "details": "This control ensures sensitive information is securely deleted when no longer required to prevent unauthorized recovery or exposure." },
      { "id": "iso-a.8.11", "security": "A.8.11 - Data masking", "priority": "Essential", "details": "This control protects sensitive information during processing or display by using data masking techniques to obscure data from unauthorized users." },
      { "id": "iso-a.8.12", "security": "A.8.12 - Data leakage prevention", "priority": "Essential", "details": "This control implements mechanisms to prevent the accidental exposure of sensitive data through email, removable media, or other channels." },
      { "id": "iso-a.8.13", "security": "A.8.13 - Information backup", "priority": "Essential", "details": "This control ensures critical information is backed up regularly and securely to ensure its availability in case of incidents or disasters." },
      { "id": "iso-a.8.14", "security": "A.8.14 - Redundancy of information processing facilities", "priority": "Essential", "details": "This control ensures redundancy is built into processing facilities to maintain availability and operations during system failures or emergencies." },
      { "id": "iso-a.8.15", "security": "A.8.15 - Logging", "priority": "Essential", "details": "This control enables logging of activities within systems to support monitoring, incident detection, and forensic investigations." },
      { "id": "iso-a.8.16", "security": "A.8.16 - Monitoring activities", "priority": "Essential", "details": "This control ensures the ongoing monitoring of system activities to detect, respond to, and mitigate security threats." },
      { "id": "iso-a.8.17", "security": "A.8.17 - Clock synchronization", "priority": "Essential", "details": "This control ensures system clocks are synchronized to maintain accurate and consistent timestamps for logs and other critical processes." },
      { "id": "iso-a.8.18", "security": "A.8.18 - Use of privileged utility programs", "priority": "Essential", "details": "This control restricts and monitors the use of privileged utility programs to prevent misuse and unauthorized actions." },
      { "id": "iso-a.8.19", "security": "A.8.19 - Installation of software on operational systems", "priority": "Essential", "details": "This control ensures software installation on operational systems is managed securely to prevent vulnerabilities or unauthorized changes." },
      { "id": "iso-a.8.20", "security": "A.8.20 - Networks security", "priority": "Essential", "details": "This control ensures network security through firewalls, intrusion detection systems, and access controls to protect against unauthorized access and attacks." },
      { "id": "iso-a.8.21", "security": "A.8.21 - Security of network services", "priority": "Essential", "details": "This control ensures network services are protected to maintain confidentiality, integrity, and availability during use." },
      { "id": "iso-a.8.22", "security": "A.8.22 - Segregation of networks", "priority": "Essential", "details": "This control implements network segregation to limit the spread of threats and minimize the impact of potential breaches." },
      { "id": "iso-a.8.23", "security": "A.8.23 - Web filtering", "priority": "Essential", "details": "This control uses web filtering tools to block unauthorized or harmful content from being accessed over the internet." },
      { "id": "iso-a.8.24", "security": "A.8.24 - Use of cryptography", "priority": "Essential", "details": "This control ensures cryptographic techniques are applied to protect data confidentiality, integrity, and authenticity." },
      { "id": "iso-a.8.25", "security": "A.8.25 - Secure development life cycle", "priority": "Essential", "details": "This control integrates security into all stages of the development life cycle to ensure systems and applications are built securely." },
      { "id": "iso-a.8.26", "security": "A.8.26 - Application security requirements", "priority": "Essential", "details": "This control defines and enforces security requirements for applications to safeguard against vulnerabilities." },
      { "id": "iso-a.8.27", "security": "A.8.27 - Secure system architecture and engineering principles", "priority": "Essential", "details": "This control ensures secure design principles are adopted during the development of system architectures." },
      { "id": "iso-a.8.28", "security": "A.8.28 - Secure coding", "priority": "Essential", "details": "This control implements secure coding practices to minimize vulnerabilities in developed software." },
      { "id": "iso-a.8.29", "security": "A.8.29 - Security testing in development and acceptance", "priority": "Essential", "details": "This control ensures security testing is conducted during development and acceptance phases to identify weaknesses." },
      { "id": "iso-a.8.30", "security": "A.8.30 - Outsourced development", "priority": "Essential", "details": "This control ensures security risks are managed effectively when development is outsourced to third-party vendors." },
      { "id": "iso-a.8.31", "security": "A.8.31 - Separation of development, test and production environments", "priority": "Essential", "details": "This control ensures development, test, and production environments are segregated to prevent unintended interactions and unauthorized access." },
      { "id": "iso-a.8.32", "security": "A.8.32 - Change management", "priority": "Essential", "details": "This control ensures changes to systems are managed securely to minimize risks and maintain operational stability." },
      { "id": "iso-a.8.33", "security": "A.8.33 - Test information", "priority": "Essential", "details": "This control protects test data to prevent the exposure of sensitive or confidential information during testing processes." },
      { "id": "iso-a.8.34", "security": "A.8.34 - Protection of information systems during audit testing", "priority": "Essential", "details": "This control ensures that systems and data are safeguarded during audits by preventing unauthorized access, data leakage, or disruptions. Measures include using non-production environments, access restrictions, and confidentiality agreements to maintain system security and integrity." }
    ]
  }
]
